  RFC 9271   UPS Management Protocol   August 2022
  ---------- ------------------------- -------------
  Price      Informational             \[Page\]

::: {#external-metadata .document-information}
:::

::: {#internal-metadata .document-information}

Stream:
:   Independent Submission

RFC:
:   [9271](https://www.rfc-editor.org/rfc/rfc9271){.eref}

Category:
:   Informational

Published:
:   August 2022

ISSN:
:   2070-1721

Author:

:   ::: author
    ::: author-name
    R. Price, [Ed.]{.editor}
    :::

    ::: org
    Network UPS Tools Project
    :::
    :::
:::

# RFC 9271 {#rfcnum}

# Uninterruptible Power Supply (UPS) Management Protocol \-- Commands and Responses {#title}

::: {#section-abstract .section}
## [Abstract](#abstract){.selfRef}

This document describes the command/response protocol currently used in
the management of Uninterruptible Power Supply (UPS) units and other
power devices often deployed in small offices and in IT installations
subject to an erratic public power supply. The UPS units typically
interface to an Attachment Daemon in the system they protect. This
daemon is in turn polled by a Management Daemon that notifies users and
system administrators of power supply incidents and automates system
shutdown decisions. The commands and responses described by this
document are exchanged between the UPS Attachment Daemon and the
Management Daemon. The practice current when this protocol was first
developed risks weak security, and this is addressed in the Security
Considerations sections of this
document.[¶](#section-abstract-1){.pilcrow}
:::

::: {#status-of-memo}
::: {#section-boilerplate.1 .section}
## [Status of This Memo](#name-status-of-this-memo){.section-name .selfRef} {#name-status-of-this-memo}

This document is not an Internet Standards Track specification; it is
published for informational
purposes.[¶](#section-boilerplate.1-1){.pilcrow}

This is a contribution to the RFC Series, independently of any other RFC
stream. The RFC Editor has chosen to publish this document at its
discretion and makes no statement about its value for implementation or
deployment. Documents approved for publication by the RFC Editor are not
candidates for any level of Internet Standard; see Section 2 of RFC
7841.[¶](#section-boilerplate.1-2){.pilcrow}

Information about the current status of this document, any errata, and
how to provide feedback on it may be obtained at
<https://www.rfc-editor.org/info/rfc9271>.[¶](#section-boilerplate.1-3){.pilcrow}
:::
:::

::: {#copyright}
::: {#section-boilerplate.2 .section}
## [Copyright Notice](#name-copyright-notice){.section-name .selfRef} {#name-copyright-notice}

Copyright (c) 2022 IETF Trust and the persons identified as the document
authors. All rights reserved.[¶](#section-boilerplate.2-1){.pilcrow}

This document is subject to BCP 78 and the IETF Trust\'s Legal
Provisions Relating to IETF Documents
(<https://trustee.ietf.org/license-info>) in effect on the date of
publication of this document. Please review these documents carefully,
as they describe your rights and restrictions with respect to this
document.[¶](#section-boilerplate.2-2){.pilcrow}
:::
:::

::: {#toc}
::: {#section-toc.1 .section}
[▲](#){.toplink}

## [Table of Contents](#name-table-of-contents){.section-name .selfRef} {#name-table-of-contents}

-   ::: {#section-toc.1-1.1}
    [1](#section-1){.xref}.  [Introduction](#name-introduction){.xref}

    -   ::: {#section-toc.1-1.1.2.1}
        [1.1](#section-1.1){.xref}.  [Current
        Practice](#name-current-practice){.xref}

        -   ::: {#section-toc.1-1.1.2.1.2.1}
            [1.1.1](#section-1.1.1){.xref}.  [NUT
            Project](#name-nut-project){.xref}
            :::

        -   ::: {#section-toc.1-1.1.2.1.2.2}
            [1.1.2](#section-1.1.2){.xref}.  [The Shutdown
            Story](#name-the-shutdown-story){.xref}
            :::

        -   ::: {#section-toc.1-1.1.2.1.2.3}
            [1.1.3](#section-1.1.3){.xref}.  [How to Read this
            Document](#name-how-to-read-this-document){.xref}
            :::
        :::

    -   ::: {#section-toc.1-1.1.2.2}
        [1.2](#section-1.2){.xref}.  [Additional
        Information](#name-additional-information){.xref}
        :::

    -   ::: {#section-toc.1-1.1.2.3}
        [1.3](#section-1.3){.xref}.  [Requirements
        Language](#name-requirements-language){.xref}
        :::
    :::

-   ::: {#section-toc.1-1.2}
    [2](#section-2){.xref}.  [Terminology](#name-terminology){.xref}

    -   ::: {#section-toc.1-1.2.2.1}
        [2.1](#section-2.1){.xref}.  [Administrative
        User](#name-administrative-user){.xref}
        :::

    -   ::: {#section-toc.1-1.2.2.2}
        [2.2](#section-2.2){.xref}.  [Attachment
        Daemon](#name-attachment-daemon){.xref}
        :::

    -   ::: {#section-toc.1-1.2.2.3}
        [2.3](#section-2.3){.xref}.  [Driver](#name-driver){.xref}
        :::

    -   ::: {#section-toc.1-1.2.2.4}
        [2.4](#section-2.4){.xref}.  [Event](#name-event){.xref}
        :::

    -   ::: {#section-toc.1-1.2.2.5}
        [2.5](#section-2.5){.xref}.  [Instant
        Command](#name-instant-command){.xref}
        :::

    -   ::: {#section-toc.1-1.2.2.6}
        [2.6](#section-2.6){.xref}.  [Management
        Daemon](#name-management-daemon){.xref}
        :::

    -   ::: {#section-toc.1-1.2.2.7}
        [2.7](#section-2.7){.xref}.  [Primary](#name-primary){.xref}
        :::

    -   ::: {#section-toc.1-1.2.2.8}
        [2.8](#section-2.8){.xref}.  [Secondary](#name-secondary){.xref}
        :::

    -   ::: {#section-toc.1-1.2.2.9}
        [2.9](#section-2.9){.xref}.  [Session](#name-session){.xref}
        :::

    -   ::: {#section-toc.1-1.2.2.10}
        [2.10](#section-2.10){.xref}. [UPS
        Status](#name-ups-status){.xref}
        :::

    -   ::: {#section-toc.1-1.2.2.11}
        [2.11](#section-2.11){.xref}. [UPS
        Variable](#name-ups-variable){.xref}
        :::
    :::

-   ::: {#section-toc.1-1.3}
    [3](#section-3){.xref}.  [Protocol
    Overview](#name-protocol-overview){.xref}
    :::

-   ::: {#section-toc.1-1.4}
    [4](#section-4){.xref}.  [Protocol
    Specification](#name-protocol-specification){.xref}

    -   ::: {#section-toc.1-1.4.2.1}
        [4.1](#section-4.1){.xref}.  [Notation Used in this
        Specification](#name-notation-used-in-this-speci){.xref}
        :::

    -   ::: {#section-toc.1-1.4.2.2}
        [4.2](#section-4.2){.xref}.  [Commands](#name-commands){.xref}

        -   ::: {#section-toc.1-1.4.2.2.2.1}
            [4.2.1](#section-4.2.1){.xref}.  [`ATTACH`](#name-attach){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.2}
            [4.2.2](#section-4.2.2){.xref}.  [`DETACH`](#name-detach){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.3}
            [4.2.3](#section-4.2.3){.xref}.  [`FSD`](#name-fsd){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.4}
            [4.2.4](#section-4.2.4){.xref}.  [`GET`](#name-get){.xref}

            -   ::: {#section-toc.1-1.4.2.2.2.4.2.1}
                [4.2.4.1](#section-4.2.4.1){.xref}.  [`GET CMDDESC`](#name-get-cmddesc){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.4.2.2}
                [4.2.4.2](#section-4.2.4.2){.xref}.  [`GET DESC`](#name-get-desc){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.4.2.3}
                [4.2.4.3](#section-4.2.4.3){.xref}.  [`GET NUMATTACH`](#name-get-numattach){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.4.2.4}
                [4.2.4.4](#section-4.2.4.4){.xref}.  [`GET TYPE`](#name-get-type){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.4.2.5}
                [4.2.4.5](#section-4.2.4.5){.xref}.  [`GET UPSDESC`](#name-get-upsdesc){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.4.2.6}
                [4.2.4.6](#section-4.2.4.6){.xref}.  [`GET VAR`](#name-get-var){.xref}
                :::
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.5}
            [4.2.5](#section-4.2.5){.xref}.  [`HELP`](#name-help){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.6}
            [4.2.6](#section-4.2.6){.xref}.  [`INSTCMD`](#name-instcmd){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.7}
            [4.2.7](#section-4.2.7){.xref}.  [`LIST`](#name-list){.xref}

            -   ::: {#section-toc.1-1.4.2.2.2.7.2.1}
                [4.2.7.1](#section-4.2.7.1){.xref}.  [`LIST CLIENT`](#name-list-client){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.7.2.2}
                [4.2.7.2](#section-4.2.7.2){.xref}.  [`LIST CMD`](#name-list-cmd){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.7.2.3}
                [4.2.7.3](#section-4.2.7.3){.xref}.  [`LIST ENUM`](#name-list-enum){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.7.2.4}
                [4.2.7.4](#section-4.2.7.4){.xref}.  [`LIST RANGE`](#name-list-range){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.7.2.5}
                [4.2.7.5](#section-4.2.7.5){.xref}.  [`LIST RW`](#name-list-rw){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.7.2.6}
                [4.2.7.6](#section-4.2.7.6){.xref}.  [`LIST UPS`](#name-list-ups){.xref}
                :::

            -   ::: {#section-toc.1-1.4.2.2.2.7.2.7}
                [4.2.7.7](#section-4.2.7.7){.xref}.  [`LIST VAR`](#name-list-var){.xref}
                :::
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.8}
            [4.2.8](#section-4.2.8){.xref}.  [`PASSWORD`](#name-password){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.9}
            [4.2.9](#section-4.2.9){.xref}.  [`PRIMARY`](#name-primary-2){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.10}
            [4.2.10](#section-4.2.10){.xref}. [`PROTVER`](#name-protver){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.11}
            [4.2.11](#section-4.2.11){.xref}. [`SET`](#name-set){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.12}
            [4.2.12](#section-4.2.12){.xref}. [`STARTTLS`](#name-starttls){.xref}

            -   ::: {#section-toc.1-1.4.2.2.2.12.2.1}
                [4.2.12.1](#section-4.2.12.1){.xref}.  [Key
                Infrastructure and Self-Signed
                Certificates](#name-key-infrastructure-and-self){.xref}
                :::
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.13}
            [4.2.13](#section-4.2.13){.xref}. [`USERNAME`](#name-username){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.2.2.14}
            [4.2.14](#section-4.2.14){.xref}. [`VER`](#name-ver){.xref}
            :::
        :::

    -   ::: {#section-toc.1-1.4.2.3}
        [4.3](#section-4.3){.xref}.  [Summary of
        Responses](#name-summary-of-responses){.xref}

        -   ::: {#section-toc.1-1.4.2.3.2.1}
            [4.3.1](#section-4.3.1){.xref}.  [Response When Command
            Succeeds](#name-response-when-command-succe){.xref}
            :::

        -   ::: {#section-toc.1-1.4.2.3.2.2}
            [4.3.2](#section-4.3.2){.xref}.  [Error
            Responses](#name-error-responses){.xref}
            :::
        :::

    -   ::: {#section-toc.1-1.4.2.4}
        [4.4](#section-4.4){.xref}.  [An ABNF of the
        Commands](#name-an-abnf-of-the-commands){.xref}

        -   ::: {#section-toc.1-1.4.2.4.2.1}
            [4.4.1](#section-4.4.1){.xref}.  [Responses to
            Commands](#name-responses-to-commands){.xref}
            :::
        :::
    :::

-   ::: {#section-toc.1-1.5}
    [5](#section-5){.xref}.  [Statuses and
    Events](#name-statuses-and-events){.xref}

    -   ::: {#section-toc.1-1.5.2.1}
        [5.1](#section-5.1){.xref}.  [Status
        Symbols](#name-status-symbols){.xref}
        :::

    -   ::: {#section-toc.1-1.5.2.2}
        [5.2](#section-5.2){.xref}.  [Events](#name-events){.xref}
        :::
    :::

-   ::: {#section-toc.1-1.6}
    [6](#section-6){.xref}.  [Security
    Considerations](#name-security-considerations){.xref}

    -   ::: {#section-toc.1-1.6.2.1}
        [6.1](#section-6.1){.xref}.  [Current General Security
        Practice](#name-current-general-security-pr){.xref}
        :::

    -   ::: {#section-toc.1-1.6.2.2}
        [6.2](#section-6.2){.xref}.  [Communication Security
        Requirements](#name-communication-security-requ){.xref}

        -   ::: {#section-toc.1-1.6.2.2.2.1}
            [6.2.1](#section-6.2.1){.xref}.  [Certificate
            Security](#name-certificate-security){.xref}
            :::
        :::

    -   ::: {#section-toc.1-1.6.2.3}
        [6.3](#section-6.3){.xref}.  [Attacks and
        Defenses](#name-attacks-and-defenses){.xref}

        -   ::: {#section-toc.1-1.6.2.3.2.1}
            [6.3.1](#section-6.3.1){.xref}.  [Eavesdropping](#name-eavesdropping){.xref}

            -   ::: {#section-toc.1-1.6.2.3.2.1.2.1}
                [6.3.1.1](#section-6.3.1.1){.xref}.  [Misplaced
                Declarations Requiring
                TLS](#name-misplaced-declarations-requ){.xref}
                :::

            -   ::: {#section-toc.1-1.6.2.3.2.1.2.2}
                [6.3.1.2](#section-6.3.1.2){.xref}.  [Weak Protection in
                Previous Version
                2.7.4](#name-weak-protection-in-previous){.xref}
                :::
            :::

        -   ::: {#section-toc.1-1.6.2.3.2.2}
            [6.3.2](#section-6.3.2){.xref}.  [Man-in-the-Middle](#name-man-in-the-middle){.xref}
            :::

        -   ::: {#section-toc.1-1.6.2.3.2.3}
            [6.3.3](#section-6.3.3){.xref}.  [Masquerade Attack: Agent
            Verification](#name-masquerade-attack-agent-ver){.xref}
            :::

        -   ::: {#section-toc.1-1.6.2.3.2.4}
            [6.3.4](#section-6.3.4){.xref}.  [Message Insertion,
            Deletion, and
            Modification](#name-message-insertion-deletion-){.xref}
            :::

        -   ::: {#section-toc.1-1.6.2.3.2.5}
            [6.3.5](#section-6.3.5){.xref}.  [Replay](#name-replay){.xref}
            :::

        -   ::: {#section-toc.1-1.6.2.3.2.6}
            [6.3.6](#section-6.3.6){.xref}.  [Denial of
            Service](#name-denial-of-service){.xref}
            :::
        :::
    :::

-   ::: {#section-toc.1-1.7}
    [7](#section-7){.xref}.  [IANA
    Considerations](#name-iana-considerations){.xref}
    :::

-   ::: {#section-toc.1-1.8}
    [8](#section-8){.xref}.  [Implementation
    Status](#name-implementation-status){.xref}

    -   ::: {#section-toc.1-1.8.2.1}
        [8.1](#section-8.1){.xref}.  [Inclusion in Software
        Distributions](#name-inclusion-in-software-distr){.xref}
        :::

    -   ::: {#section-toc.1-1.8.2.2}
        [8.2](#section-8.2){.xref}.  [Recommended Minimum
        Support](#name-recommended-minimum-support){.xref}

        -   ::: {#section-toc.1-1.8.2.2.2.1}
            [8.2.1](#section-8.2.1){.xref}.  [Desktop PC
            Variables](#name-desktop-pc-variables){.xref}
            :::

        -   ::: {#section-toc.1-1.8.2.2.2.2}
            [8.2.2](#section-8.2.2){.xref}.  [Unattended Servers and
            Additional
            Variables](#name-unattended-servers-and-addi){.xref}
            :::

        -   ::: {#section-toc.1-1.8.2.2.2.3}
            [8.2.3](#section-8.2.3){.xref}.  [Commands and Other
            Technical Terms](#name-commands-and-other-technica){.xref}
            :::

        -   ::: {#section-toc.1-1.8.2.2.2.4}
            [8.2.4](#section-8.2.4){.xref}.  [Support for Earlier
            Versions](#name-support-for-earlier-version){.xref}
            :::
        :::
    :::

-   ::: {#section-toc.1-1.9}
    [9](#section-9){.xref}.  [References](#name-references){.xref}

    -   ::: {#section-toc.1-1.9.2.1}
        [9.1](#section-9.1){.xref}.  [Normative
        References](#name-normative-references){.xref}
        :::

    -   ::: {#section-toc.1-1.9.2.2}
        [9.2](#section-9.2){.xref}.  [Informative
        References](#name-informative-references){.xref}
        :::
    :::

-   ::: {#section-toc.1-1.10}
    [Appendix
    A](#appendix-A){.xref}.  [Variables](#name-variables){.xref}

    -   ::: {#section-toc.1-1.10.2.1}
        [A.1](#appendix-A.1){.xref}.  [Typical UPS
        Variables](#name-typical-ups-variables){.xref}
        :::

    -   ::: {#section-toc.1-1.10.2.2}
        [A.2](#appendix-A.2){.xref}.  [Typical UPS Readable and Writable
        Variables](#name-typical-ups-readable-and-wr){.xref}
        :::

    -   ::: {#section-toc.1-1.10.2.3}
        [A.3](#appendix-A.3){.xref}.  [Typical UPS Instant
        Commands](#name-typical-ups-instant-command){.xref}
        :::
    :::

-   ::: {#section-toc.1-1.11}
    [Appendix B](#appendix-B){.xref}.  [The Shutdown Story for System
    and UPS](#name-the-shutdown-story-for-syst){.xref}
    :::

-   ::: {#section-toc.1-1.12}
    [Appendix C](#appendix-C){.xref}.  [Technical Terms: Historical
    Differences](#name-technical-terms-historical-){.xref}
    :::

-   ::: {#section-toc.1-1.13}
    [Appendix D](#appendix-D){.xref}.  [Security Defenses in Release
    2.7.4](#name-security-defenses-in-releas){.xref}

    -   ::: {#section-toc.1-1.13.2.1}
        [D.1](#appendix-D.1){.xref}.  [Shims](#name-shims){.xref}

        -   ::: {#section-toc.1-1.13.2.1.2.1}
            [D.1.1](#appendix-D.1.1){.xref}.  [Attachment Daemon
            Shim](#name-attachment-daemon-shim){.xref}
            :::

        -   ::: {#section-toc.1-1.13.2.1.2.2}
            [D.1.2](#appendix-D.1.2){.xref}.  [Management Daemon
            Shim](#name-management-daemon-shim){.xref}
            :::
        :::

    -   ::: {#section-toc.1-1.13.2.2}
        [D.2](#appendix-D.2){.xref}.  [TLS
        Tunnels](#name-tls-tunnels){.xref}
        :::

    -   ::: {#section-toc.1-1.13.2.3}
        [D.3](#appendix-D.3){.xref}.  [VPN](#name-vpn){.xref}
        :::

    -   ::: {#section-toc.1-1.13.2.4}
        [D.4](#appendix-D.4){.xref}.  [VLAN](#name-vlan){.xref}
        :::
    :::

-   ::: {#section-toc.1-1.14}
    [Appendix E](#appendix-E){.xref}.  [Administrative
    Security](#name-administrative-security){.xref}

    -   ::: {#section-toc.1-1.14.2.1}
        [E.1](#appendix-E.1){.xref}.  [Management of Administrative
        Users](#name-management-of-administrativ){.xref}
        :::

    -   ::: {#section-toc.1-1.14.2.2}
        [E.2](#appendix-E.2){.xref}.  [An Administrative User of a
        Client Management
        Daemon](#name-an-administrative-user-of-a){.xref}

        -   ::: {#section-toc.1-1.14.2.2.2.1}
            [E.2.1](#appendix-E.2.1){.xref}.  [An Administrative User
            Logs into a Short
            Session](#name-an-administrative-user-logs){.xref}
            :::

        -   ::: {#section-toc.1-1.14.2.2.2.2}
            [E.2.2](#appendix-E.2.2){.xref}.  [An Administrative User
            Logs into a Long
            Session](#name-an-administrative-user-logs-){.xref}
            :::
        :::
    :::

-   ::: {#section-toc.1-1.15}
    [](#appendix-F){.xref}[Acknowledgments](#name-acknowledgments){.xref}
    :::

-   ::: {#section-toc.1-1.16}
    [](#appendix-G){.xref}[Author\'s
    Address](#name-authors-address){.xref}
    :::
:::
:::

::: {#section-1 .section}
## [1.](#section-1){.section-number .selfRef} [Introduction](#name-introduction){.section-name .selfRef} {#name-introduction}

::: {#intro}
::: {#section-1.1 .section}
### [1.1.](#section-1.1){.section-number .selfRef} [Current Practice](#name-current-practice){.section-name .selfRef} {#name-current-practice}

This document describes UPS management techniques and current UPS
management practice published by the Network UPS Tools (NUT) Project.
The document is based on version 2.8.0 of the NUT Project software,
which supports version 1.3 of the NUT
protocol.[¶](#section-1.1-1){.pilcrow}

Since May 2002, the protocol described by this document has been
operating on IANA port 3493/TCP (nut).[¶](#section-1.1-2){.pilcrow}

::: {#proj}
::: {#section-1.1.1 .section}
#### [1.1.1.](#section-1.1.1){.section-number .selfRef} [NUT Project](#name-nut-project){.section-name .selfRef} {#name-nut-project}

The primary goal of the Network UPS Tools (NUT) Project software
\[[NUT](#NUT){.xref}\] is to provide support for power devices, such as
UPSs. The project has been in operation since 1998, with a major rework
in 2003. It operates through a user [mailing list](#nut-upsuser){.xref}
\[[nut-upsuser](#nut-upsuser){.xref}\], a developer [mailing
list](#nut-upsdev){.xref} \[[nut-upsdev](#nut-upsdev){.xref}\], a
[website](#NUT){.xref} \[[NUT](#NUT){.xref}\], and a [GitHub
repository](#nut-repository){.xref}
\[[nut-repository](#nut-repository){.xref}\]. See
\[[githist](#githist){.xref}\] and Appendix J of
\[[History](#History){.xref}\] for a history of the
project.[¶](#section-1.1.1-1){.pilcrow}
:::
:::

::: {#TSS}
::: {#section-1.1.2 .section}
#### [1.1.2.](#section-1.1.2){.section-number .selfRef} [The Shutdown Story](#name-the-shutdown-story){.section-name .selfRef} {#name-the-shutdown-story}

The Shutdown Story section (see [Appendix B](#shutdownstory){.xref})
describes the current UPS management practice for performing a managed
shutdown of unattended infrastructure after an unscheduled failure of
the public power supply in order to minimize the risk of corruption to
data processed by this infrastructure.[¶](#section-1.1.2-1){.pilcrow}
:::
:::

::: {#HowtoRead}
::: {#section-1.1.3 .section}
#### [1.1.3.](#section-1.1.3){.section-number .selfRef} [How to Read this Document](#name-how-to-read-this-document){.section-name .selfRef} {#name-how-to-read-this-document}

As a simplification to ease reading, the term \"UPS\" is used when
\"Managed Power Device\" would be more complete. The reader should
understand the simple \"UPS\" to include other managed power
devices.[¶](#section-1.1.3-1){.pilcrow}

The statuses and events appearing in this document are named with short
text-form names, some of which are abbreviations. A full list of the
statuses can be found in [Section 5.1](#symbols){.xref}, while the
events are listed in [Section
5.2](#events){.xref}.[¶](#section-1.1.3-2){.pilcrow}

This document refers to the \"public power supply\". Other texts
frequently refer to \"utility power\", \"input source power\", or even
\"wall power\".[¶](#section-1.1.3-3){.pilcrow}
:::
:::
:::
:::

::: {#AddInf}
::: {#section-1.2 .section}
### [1.2.](#section-1.2){.section-number .selfRef} [Additional Information](#name-additional-information){.section-name .selfRef} {#name-additional-information}

Additional information about the NUT Project is available in the
[project documentation](#Documentation){.xref}
\[[Documentation](#Documentation){.xref}\]. Requests for further
information about this protocol and related technical matters may be
addressed to the [mailing list](#nut-upsuser){.xref}
\[[nut-upsuser](#nut-upsuser){.xref}\] of the NUT
Project.[¶](#section-1.2-1){.pilcrow}
:::
:::

::: {#section-1.3 .section}
### [1.3.](#section-1.3){.section-number .selfRef} [Requirements Language](#name-requirements-language){.section-name .selfRef} {#name-requirements-language}

The key words \"[MUST]{.bcp14}\", \"[MUST NOT]{.bcp14}\",
\"[REQUIRED]{.bcp14}\", \"[SHALL]{.bcp14}\", \"[SHALL NOT]{.bcp14}\",
\"[SHOULD]{.bcp14}\", \"[SHOULD NOT]{.bcp14}\",
\"[RECOMMENDED]{.bcp14}\", \"[NOT RECOMMENDED]{.bcp14}\",
\"[MAY]{.bcp14}\", and \"[OPTIONAL]{.bcp14}\" in this document are to be
interpreted as described in BCP 14 \[[RFC2119](#RFC2119){.xref}\]
\[[RFC8174](#RFC8174){.xref}\] when, and only when, they appear in all
capitals, as shown here.[¶](#section-1.3-1){.pilcrow}
:::
:::

::: {#Terminology}
::: {#section-2 .section}
## [2.](#section-2){.section-number .selfRef} [Terminology](#name-terminology){.section-name .selfRef} {#name-terminology}

The following technical terms appear in this document. They are listed
in alphabetical order.[¶](#section-2-1){.pilcrow}

::: {#au}
::: {#section-2.1 .section}
### [2.1.](#section-2.1){.section-number .selfRef} [Administrative User](#name-administrative-user){.section-name .selfRef} {#name-administrative-user}

In current practice, the commands and other functions offered by the
Attachment Daemon are made available to a set of users known as
Management Daemons. These Management Daemons authenticate to the
Attachment Daemon with basic credentials (username and password).
Although called \"users\", the administrative users are not system
users; they are specific to an Attachment Daemon and are listed in a
text file (currently `upsd.users`) that is read by the Attachment Daemon
and that assigns to each of them the password, Instant Commands, and
actions that are allowed, together with the Primary or Secondary status
of the Management Daemon. For details, see [Appendix
E.1](#adminuser){.xref}. For details of the Primary, see [Section
2.7](#prim){.xref}; for details of the Secondary, see [Section
2.8](#sec){.xref}. Typically, a high-level user will be able to send
command `FSD`, but a low-level user might only be allowed to access the
test panel. The security provisions for administrative users are
discussed in [Appendix E](#adsec){.xref}.[¶](#section-2.1-1){.pilcrow}
:::
:::

::: {#AD}
::: {#section-2.2 .section}
### [2.2.](#section-2.2){.section-number .selfRef} [Attachment Daemon](#name-attachment-daemon){.section-name .selfRef} {#name-attachment-daemon}

The Attachment Daemon retrieves the status from the UPS and sends
commands to it often through a Driver specific to the hardware model and
the connection medium, e.g., USB, serial. See [Section
2.3](#Driver){.xref}. It maintains an abstracted view of the hardware
through the use of hardware statuses. See [Section 2.10](#st){.xref}. A
Management Daemon may consult the abstracted view using the commands
described in this document.[¶](#section-2.2-1){.pilcrow}

See [Section 8.2](#MinSup){.xref} for details of the recommended minimum
support of variables, which calls for Attachment Daemon support of
statuses `OB`, `OL`, `LB`, and `FSD`.[¶](#section-2.2-2){.pilcrow}

The NUT Project has implemented an Attachment Daemon as program `upsd`
and a set of hardware-specific Drivers, all written in K&R C
\[[C2ndEd](#C2ndEd){.xref}\]. The Attachment Daemon is launched as
system user \"root\" but for better security; then, it drops the
privilege to run as a detached software
service.[¶](#section-2.2-3){.pilcrow}
:::
:::

::: {#Driver}
::: {#section-2.3 .section}
### [2.3.](#section-2.3){.section-number .selfRef} [Driver](#name-driver){.section-name .selfRef} {#name-driver}

A Driver is that part of an Attachment Daemon that is specific to the
UPS hardware, the connection medium, and the connection protocol, e.g.,
USB, serial. In current practice, the Attachment Daemon has a Driver for
each hardware interface type it supports. Although this document
considers the Driver to be part of the Attachment Daemon, current
practice is to see it as a separate software unit running as a daemon
\"in front of\" the Attachment Daemon. The protocol for data exchange
between the Driver and the Attachment Daemon is outside the scope of
this document.[¶](#section-2.3-1){.pilcrow}
:::
:::

::: {#section-2.4 .section}
### [2.4.](#section-2.4){.section-number .selfRef} [Event](#name-event){.section-name .selfRef} {#name-event}

A UPS event occurs in the Management Daemon when a change in the UPS
status is received from the Attachment Daemon. This event is internal to
the Management Daemon. See [Section
5.2](#events){.xref}.[¶](#section-2.4-1){.pilcrow}
:::

::: {#IC}
::: {#section-2.5 .section}
### [2.5.](#section-2.5){.section-number .selfRef} [Instant Command](#name-instant-command){.section-name .selfRef} {#name-instant-command}

An Instant Command is a command that, when sent to the Attachment
Daemon, is passed to the Driver and sent to the hardware without any
configured delay to perform a function. For example,
`INSTCMD su700 test.panel.start`. See [Section
4.2.6](#instcmd){.xref}.[¶](#section-2.5-1){.pilcrow}
:::
:::

::: {#MD}
::: {#section-2.6 .section}
### [2.6.](#section-2.6){.section-number .selfRef} [Management Daemon](#name-management-daemon){.section-name .selfRef} {#name-management-daemon}

The Management Daemon is primarily responsible for managing the hardware
and orchestrating system-wide actions after a power event. Using
commands sent to the Attachment Daemon, it follows the status of the UPS
and determines when UPS events occur. It takes decisions based on the
events, such as calling for a system shutdown. See [Appendix
B](#shutdownstory){.xref}. Although the term includes the word
\"Daemon\", nothing requires that it be implemented as a detached
software service. The Management Daemon may also provide administrative
functions, such as a graphic interface to view the hardware
activity.[¶](#section-2.6-1){.pilcrow}

There are several examples of a Management Daemon: the NUT Project
provides `upsmon`, which takes the system shutdown decision when the
public power supply fails. Further configuration options, such as
timers, are provided by the helper program
`upssched`.[¶](#section-2.6-2){.pilcrow}

::: {#util}
Other programs represent the Management
Daemon:[¶](#section-2.6-3){.pilcrow}
:::

-   [`upsc` reports the values of the variables defined for a given UPS;
    see [Table
    6](#typvar){.xref}.[¶](#section-2.6-4.1){.pilcrow}]{#section-2.6-4.1}
-   [`upsrw` reports on and changes the values of the readable and
    writable configuration variables defined for a given UPS; see
    [Appendix
    A.2](#rw){.xref}.[¶](#section-2.6-4.2){.pilcrow}]{#section-2.6-4.2}
-   [`upscmd` reports on and executes the instant action commands
    defined for a given UPS; see [Section
    4.2.6](#instcmd){.xref}.[¶](#section-2.6-4.3){.pilcrow}]{#section-2.6-4.3}
-   [`UPSmon.py` is an experimental Python3 rewrite of `upsmon` and
    `upssched` that includes support for [TLS 1.3](#RFC8446){.xref}
    \[[RFC8446](#RFC8446){.xref}\].[¶](#section-2.6-4.4){.pilcrow}]{#section-2.6-4.4}
:::
:::

::: {#prim}
::: {#section-2.7 .section}
### [2.7.](#section-2.7){.section-number .selfRef} [Primary](#name-primary){.section-name .selfRef} {#name-primary}

When a power device, such as a UPS unit, supplies power to more than one
system, the computer running the Driver is known as the Primary. The
others are Secondaries. See [Figure 4](#fig.oview4){.xref}. Common
current practice for system administrators is to consider the Management
Daemon in the Primary to be the Primary Management Daemon that is in
charge of the shutdown of all the systems powered by the UPS. The
Primary Management Daemon sets status symbol `FSD` to order the
Secondaries to shut down.[¶](#section-2.7-1){.pilcrow}

Note: Historically, the Primary was known as the
\"Master\".[¶](#section-2.7-2.1){.pilcrow}
:::
:::

::: {#sec}
::: {#section-2.8 .section}
### [2.8.](#section-2.8){.section-number .selfRef} [Secondary](#name-secondary){.section-name .selfRef} {#name-secondary}

When a hardware device, such as a UPS unit, supplies power to more than
one system, the system that communicates directly with the UPS unit,
e.g., using a USB, RS-232, or a network connection, is known as the
Primary. The others are Secondaries. There is no Attachment Daemon in a
Secondary. See [Figure 4](#fig.oview4){.xref}. Common current practice
for system administrators is to consider the Management Daemon in a
Secondary to be a Secondary Management Daemon that understands status
symbol `FSD` as an order to shut down.[¶](#section-2.8-1){.pilcrow}

Note: Historically, the Secondary was known as the
\"Slave\".[¶](#section-2.8-2.1){.pilcrow}
:::
:::

::: {#sess}
::: {#section-2.9 .section}
### [2.9.](#section-2.9){.section-number .selfRef} [Session](#name-session){.section-name .selfRef} {#name-session}

The Management Daemon may initiate a TCP session with a specified
device, such as a UPS known to the Attachment Daemon. The session
structure provides for audit and security, as well as access to
mission-critical UPS functions. For example, good practice requires
password protection for an Instant Command that turns off a UPS outlet.
Other than the commands and responses used, the details of session
management are outside the scope of this
document.[¶](#section-2.9-1){.pilcrow}
:::
:::

::: {#st}
::: {#section-2.10 .section}
### [2.10.](#section-2.10){.section-number .selfRef} [UPS Status](#name-ups-status){.section-name .selfRef} {#name-ups-status}

The status of a hardware device, such as a UPS unit, is a symbolic
description of the state of the unit. It consists of a space-separated
list of symbols from the set {`ALARM` `BOOST` `BYPASS` `CAL` `CHRG`
`COMM` `DISCHRG` `FSD` `LB` `NOCOMM` `OB` `OFF` `OL` `OVER` `RB` `TEST`
`TRIM`}. The symbols `TICK` and `TOCK` are experimental additions to the
statuses and are not in common current practice. See [Section
5.1](#symbols){.xref}, which specifies each of these
symbols.[¶](#section-2.10-1){.pilcrow}

See [Section 8.2](#MinSup){.xref} for details of the recommended minimum
support of status symbols `OB`, `OL`, `LB`, and
`FSD`.[¶](#section-2.10-2){.pilcrow}
:::
:::

::: {#var}
::: {#section-2.11 .section}
### [2.11.](#section-2.11){.section-number .selfRef} [UPS Variable](#name-ups-variable){.section-name .selfRef} {#name-ups-variable}

The metrics and identifiers provided by each UPS are represented by
variables giving the value representing that metric or identifier. The
UPS variable is an abstraction of the UPS hardware configuration and
activity maintained by the Attachment Daemon. See [Appendix
A](#Annex1){.xref}, which provides examples of variables. For example,
the variable `battery.charge` contains the current charge of the UPS
battery as a percentage value.[¶](#section-2.11-1){.pilcrow}

Note: Some variables are constants, e.g., battery type and
manufacturer.[¶](#section-2.11-2){.pilcrow}

See [Section 8.2](#MinSup){.xref} for details of the recommended minimum
support of variables. A full list of possible variables is available in
[source code file docs/nut-names.txt](#gitvars){.xref}
\[[gitvars](#gitvars){.xref}\], which serves as the Recording
Document.[¶](#section-2.11-3){.pilcrow}
:::
:::
:::
:::

::: {#overview}
::: {#section-3 .section}
## [3.](#section-3){.section-number .selfRef} [Protocol Overview](#name-protocol-overview){.section-name .selfRef} {#name-protocol-overview}

[Figure 1](#fig.oview){.xref} shows a reference configuration in which
the command/response protocol applies. The UPS shown is representative
of all managed power devices.[¶](#section-3-1){.pilcrow}

[]{#name-reference-configuration}

::: {#fig.oview}
::: {#section-3-2.1 .alignCenter .art-ascii-art .art-text .artwork}
                                                "The client"
               ,--------------,               ,--------------,
     ,-----,   |     UPS      | <-Commands    |     UPS      |
     | UPS |---|  Attachment  |---------------|  Management  |
     |     |===|    Daemon    |   Responses-> |    Daemon    |
     /-----\   '--------------'               '--------------'
                UPS Attachment                 UPS Management
                    System        Network          System
:::

[Figure 1](#figure-1){.selfRef}: [Reference
Configuration](#name-reference-configuration){.selfRef}
:::

The reference configuration in [Figure 1](#fig.oview){.xref} shows a
single UPS unit that has a power supply link (`===`) and a data link
(`---`) attached to a system running an Attachment Daemon. The UPS
provides power supply protection to the system running the Attachment
Daemon.[¶](#section-3-3){.pilcrow}

In practice, there may be more than one UPS unit, and a unit may provide
power protection to more than one system. The figure also shows a single
Management Daemon. In practice, there may be more than one Management
Daemon, and any one Management Daemon may manage more than one UPS
Attachment Daemon.[¶](#section-3-4){.pilcrow}

The protocol applies to connections between the Attachment Daemon and
the Management Daemon, which act as the **server** and **client**,
respectively. The Management Daemon sends commands over TCP to the
Attachment Daemon and receives responses over TCP from that
daemon.[¶](#section-3-5){.pilcrow}

The two daemons may run in the same system or may be connected through a
local or wide area network. In simple cases, as shown in [Figure
2](#fig.oview2){.xref}, the Attachment Daemon and the Management Daemon
are in the same system, the one protected by the UPS. The commands and
responses are exchanged through an internal loopback
interface.[¶](#section-3-6){.pilcrow}

[]{#name-simplified-single-system-co}

::: {#fig.oview2}
::: {#section-3-7.1 .alignCenter .art-ascii-art .art-text .artwork}
                                             "The client"
               ,--------------------,---------------------,
     ,-----,   |     UPS       <-Commands        UPS      |
     | UPS |---|  Attachment        |         Management  |
     |     |===|    Daemon       Responses->    Daemon    |
     /-----\   '--------------------'---------------------'
                                 Internal
                                 Loopback
                 UPS Attachment and Management System
:::

[Figure 2](#figure-2){.selfRef}: [Simplified Single-System
Configuration](#name-simplified-single-system-co){.selfRef}
:::

The reference configuration does not require any specific design. For
example, [Figure 3](#fig.oview3){.xref} shows an arrangement in which
the Attachment Daemon is closely associated with, or even included in,
the UPS system setup. This is becoming more prevalent with the
availability of low-cost processors able to run the Attachment Daemon,
thereby effectively creating a network-attached UPS running a published
protocol.[¶](#section-3-8){.pilcrow}

[]{#name-ups-and-attachment-daemon-i}

::: {#fig.oview3}
::: {#section-3-9.1 .alignCenter .art-ascii-art .art-text .artwork}
                                          "The client"
     ,-----,------------,               ,--------------,
     |     |    UPS     | <-Commands    |     UPS      |
     | UPS - Attachment |---------------|  Management  |
     |     |   Daemon   |   Responses-> |    Daemon    |
     /-----'------------\               '--------------'
        UPS Attachment                   UPS Management
            System           Network          System
:::

[Figure 3](#figure-3){.selfRef}: [UPS and Attachment Daemon
Integration](#name-ups-and-attachment-daemon-i){.selfRef}
:::

As the power requirements for processors decrease, it is becoming
increasingly common to use a single UPS to protect multiple systems, as
shown in [Figure 4](#fig.oview4){.xref}. However, there is only one data
line (`---`) from the UPS to the Primary system. The others have only
power connections (`===`) to the UPS and are known as Secondaries. A
Secondary does not run an Attachment Daemon; it connects over a network
to the Attachment Daemon in the Primary. [Figure 4](#fig.oview4){.xref}
shows the Attachment Daemon and the Primary Management Daemon in the
same system. This is common practice, but it is not a technical
requirement.[¶](#section-3-10){.pilcrow}

[]{#name-ups-protects-multiple-syste}

::: {#fig.oview4}
::: {#section-3-11.1 .alignCenter .art-ascii-art .art-text .artwork}
                                          "The client"
               ,--------------------,---------------------,
     ,-----,   |     UPS       <-Commands      Primary    |
     |     |---|  Attachment        |         Management  |   Primary
     |     |===|    Daemon       Responses->    Daemon    |
     |     |   '--------------------'---------------------'
     | UPS |            ^
     |     |            '<-Commands---Responses->,
     |     |                                     v
     |     |            ,--------------,-----------------,
     |     |============|              |     Secondary   |
     /-----\            |              |     Management  |   Secondary
                        |              |       Daemon    |
                        '--------------'-----------------'
:::

[Figure 4](#figure-4){.selfRef}: [UPS Protects Multiple
Systems](#name-ups-protects-multiple-syste){.selfRef}
:::

Note: Should the Primary fail or go offline, the fate of the Secondaries
depends on the UPS status when the Primary failed. If the UPS had status
`OL`, the Secondary continues operation, but if the UPS had status `OB`,
the Secondary may choose to shut down as a
precaution.[¶](#section-3-12.1){.pilcrow}
:::
:::

::: {#protspec}
::: {#section-4 .section}
## [4.](#section-4){.section-number .selfRef} [Protocol Specification](#name-protocol-specification){.section-name .selfRef} {#name-protocol-specification}

This specification includes only the commands and their responses. An
implementation of the Attachment Daemon has an internal state machine,
and some complex implementations of the Management Daemon include an
internal state machine, for example, to assist the system shutdown of a
complex installation. The Management Daemon is required to remember the
previous `ups.status` value it received from the Attachment Daemon and
compare it with the next. Other than that, the management protocol used
between them is effectively stateless.[¶](#section-4-1){.pilcrow}

For example, see [Section 5.2](#events){.xref}, which shows a map of the
new `ups.status` response and the previous `ups.status` response to an
event, which is taken as the basis for Management Daemon
action.[¶](#section-4-2){.pilcrow}

::: {#Notation}
::: {#section-4.1 .section}
### [4.1.](#section-4.1){.section-number .selfRef} [Notation Used in this Specification](#name-notation-used-in-this-speci){.section-name .selfRef} {#name-notation-used-in-this-speci}

The character set used for commands and responses is US-ASCII; see
\[[RFC0020](#RFC0020){.xref}\].[¶](#section-4.1-1){.pilcrow}

Multi-word elements are contained between quotation mark characters for
easier parsing, e.g., \"UPS on fire\". Embedded quotation marks are
escaped with reverse slant (\\), often known as backslashes. Embedded
backslashes are also escaped by representing them as
\\\\.[¶](#section-4.1-2){.pilcrow}

::: {#onenewline}
Commands and responses have no leading or trailing blank space and are
terminated with a single new line character line feed
(LF).[¶](#section-4.1-3){.pilcrow}
:::

Blank space within commands and responses is reduced to one space
(SP).[¶](#section-4.1-4){.pilcrow}
:::
:::

::: {#commands}
::: {#section-4.2 .section}
### [4.2.](#section-4.2){.section-number .selfRef} [Commands](#name-commands){.section-name .selfRef} {#name-commands}

The commands address the UPS to which they apply by `<upsname>`,
where[¶](#section-4.2-1){.pilcrow}

-   [`<upsname>` ::=
    `<ups>[@<hostname>[:<port>]]`[¶](#section-4.2-2.1){.pilcrow}]{#section-4.2-2.1}
-   [`<ups>` is defined by the Attachment Daemon configuration
    files.[¶](#section-4.2-2.2){.pilcrow}]{#section-4.2-2.2}
-   [The default `<hostname>` is
    `localhost`.[¶](#section-4.2-2.3){.pilcrow}]{#section-4.2-2.3}
-   [The `<port>` is the number of the TCP port on which the Attachment
    Daemon is listening. The default is 3493. This is supported by all
    current Management
    Daemons.[¶](#section-4.2-2.4){.pilcrow}]{#section-4.2-2.4}

Examples: `myups`,
`UPS-97B@bigserver.example.com`[¶](#section-4.2-3){.pilcrow}

ABNF: See variable `upsname` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2-4){.pilcrow}

Note: Experimental Management Daemons use an extended form of
`<upsname>` in configuration files and in program parameters,
where:[¶](#section-4.2-5){.pilcrow}

-   [`<upsname>` ::=
    `[<group>:]<ups>[@<hostname>[:<port>]]`[¶](#section-4.2-6.1){.pilcrow}]{#section-4.2-6.1}
-   [`<group>` is an experimental extension to provide for groups of
    UPSs. It is not in common current
    practice.[¶](#section-4.2-6.2){.pilcrow}]{#section-4.2-6.2}
-   [`<ups>` is defined by the Attachment Daemon configuration
    files.[¶](#section-4.2-6.3){.pilcrow}]{#section-4.2-6.3}
-   [The default `<hostname>` is
    `localhost`.[¶](#section-4.2-6.4){.pilcrow}]{#section-4.2-6.4}

Examples: `ups-1@example.com:3493`,
`HB:heartbeat1@example.com:3493`[¶](#section-4.2-7){.pilcrow}

*Implementation note:* In the current implementation, the names of
commands and subcommands are not case sensitive. For example, `GET VAR`
may be written as `Get var`, but in this specification, they are always
written in uppercase. Similarly, `<upsname>` and `<varname>` are not
case sensitive. For example, `UPS341 ups.id` may be written as
`ups341 Ups.Id`, but in this specification, `<varname>` is always
written in lower case.[¶](#section-4.2-8.1){.pilcrow}

::: {#attach}
::: {#section-4.2.1 .section}
#### [4.2.1.](#section-4.2.1){.section-number .selfRef} [`ATTACH`](#name-attach){.section-name .selfRef} {#name-attach}

In a configuration like the one shown in [Figure 4](#fig.oview4){.xref},
in which a UPS protects more than one system, the Primary Management
Daemon needs to know how many Secondaries are currently *active*, i.e.,
powered by the UPS, either from the public power supply or from battery
power. The Attachment Daemon supports this by keeping a count of all the
*active* systems powered by a UPS. The count is initialized, one
Secondary at a time by the `ATTACH` command, which should be understood
as *count this Secondary as active*. `ATTACH` is one of three commands
for Secondary counting. Additionally, command `DETACH` decrements the
count, and a Management Daemon may read the count at any time using the
command `NUMATTACH`.[¶](#section-4.2.1-1){.pilcrow}

The `ATTACH` command is also sent to the Attachment Daemon for the
Primary, so during normal, fully protected operation, the count is 1 for
the Primary + the number of Secondaries. During a full system shutdown,
the count drops as each Secondary Management Daemon executes command
`DETACH` during its own shutdown. When the count drops to 1, only the
Primary is *active*, and it knows that all the Secondaries have shut
down.[¶](#section-4.2.1-2){.pilcrow}

Command: `ATTACH <upsname>`[¶](#section-4.2.1-3){.pilcrow}

If the command succeeds, the response is `OK`; otherwise, see the error
responses in [Section
4.3.2](#errorresponses){.xref}.[¶](#section-4.2.1-4){.pilcrow}

ABNF: See variable `attach` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.1-5){.pilcrow}

Note: Historically, this command was known as `LOGIN`. However, because
`LOGIN` was not the conventional user access to a shell or program, the
name was changed to avoid confusion.[¶](#section-4.2.1-6.1){.pilcrow}
:::
:::

::: {#detach}
::: {#section-4.2.2 .section}
#### [4.2.2.](#section-4.2.2){.section-number .selfRef} [`DETACH`](#name-detach){.section-name .selfRef} {#name-detach}

This companion command to `ATTACH` reduces the count of \"active\"
Secondaries. It should be understood as *this Secondary is no longer
active* and is usually used during system shutdown to decrement a count
of how many Secondaries are still
*active*.[¶](#section-4.2.2-1){.pilcrow}

Command: `DETACH`[¶](#section-4.2.2-2){.pilcrow}

If the command succeeds, the response is `OK Goodbye`; otherwise, see
the error responses in [Section
4.3.2](#errorresponses){.xref}.[¶](#section-4.2.2-3){.pilcrow}

ABNF: See variable `detach` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.2-4){.pilcrow}

Note: Historically, this command was known as
`LOGOUT`.[¶](#section-4.2.2-5.1){.pilcrow}
:::
:::

::: {#FSD}
::: {#section-4.2.3 .section}
#### [4.2.3.](#section-4.2.3){.section-number .selfRef} [`FSD`](#name-fsd){.section-name .selfRef} {#name-fsd}

A Management Daemon that is Primary and has the required authority uses
this command to set status symbol `FSD`, meaning \"Forced Shutdown\", in
the Attachment Daemon. In current practice, the Primary Management
Daemon uses the symbol to tell the Secondaries to shut
down.[¶](#section-4.2.3-1){.pilcrow}

Command: `FSD <upsname>`[¶](#section-4.2.3-2){.pilcrow}

If the command succeeds, the response is `OK FSD-SET`; otherwise, see
the error responses in [Section
4.3.2](#errorresponses){.xref}.[¶](#section-4.2.3-3){.pilcrow}

ABNF: See variable `fsd` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.3-4){.pilcrow}

In current practice, commands such as `FSD` are made available only to a
privileged administrative user authorized to send such a
mission-critical command. The security provisions for administrative
users are discussed in [Appendix
E](#adsec){.xref}.[¶](#section-4.2.3-5){.pilcrow}

Note: The symbol `FSD` is also used for an event. See [Table
5](#EventFSD){.xref}.[¶](#section-4.2.3-6){.pilcrow}
:::
:::

::: {#get}
::: {#section-4.2.4 .section}
#### [4.2.4.](#section-4.2.4){.section-number .selfRef} [`GET`](#name-get){.section-name .selfRef} {#name-get}

Retrieve a single response from the Attachment
Daemon.[¶](#section-4.2.4-1){.pilcrow}

ABNF: See variable `get` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.4-2){.pilcrow}

The possible subcommands are listed in the sections
below.[¶](#section-4.2.4-3){.pilcrow}

::: {#cmddesc}
::: {#section-4.2.4.1 .section}
##### [4.2.4.1.](#section-4.2.4.1){.section-number .selfRef} [`GET CMDDESC`](#name-get-cmddesc){.section-name .selfRef} {#name-get-cmddesc}

Retrieve a text description of a
command.[¶](#section-4.2.4.1-1){.pilcrow}

Command:
`GET CMDDESC <upsname> <cmdname>`[¶](#section-4.2.4.1-2){.pilcrow}

Response:
`CMDDESC <upsname> <cmdname> "<description>"`[¶](#section-4.2.4.1-3){.pilcrow}

For example: command `GET CMDDESC su700 load.on` and response
`CMDDESC su700 load.on "Turn on the load immediately"`[¶](#section-4.2.4.1-4){.pilcrow}

This is like `GET DESC`, but it applies to an Instant Command. See
[Section 4.2.4.2](#desc){.xref}.[¶](#section-4.2.4.1-5){.pilcrow}
:::
:::

::: {#desc}
::: {#section-4.2.4.2 .section}
##### [4.2.4.2.](#section-4.2.4.2){.section-number .selfRef} [`GET DESC`](#name-get-desc){.section-name .selfRef} {#name-get-desc}

Retrieve a text description of a UPS variable. See [Section
2.11](#var){.xref}.[¶](#section-4.2.4.2-1){.pilcrow}

Command: `GET DESC <upsname> <varname>`[¶](#section-4.2.4.2-2){.pilcrow}

Response:
`DESC <upsname> <varname> "<description>"`[¶](#section-4.2.4.2-3){.pilcrow}

`<description>` is a string that gives a brief explanation of the named
variable. The Attachment Daemon [MAY]{.bcp14} return \"Unavailable\" if
the file that provides this description is not
installed.[¶](#section-4.2.4.2-4){.pilcrow}

For example: command `GET DESC su700 ups.status` and response
`DESC su700 ups.status "UPS status"`[¶](#section-4.2.4.2-5){.pilcrow}
:::
:::

::: {#numattach}
::: {#section-4.2.4.3 .section}
##### [4.2.4.3.](#section-4.2.4.3){.section-number .selfRef} [`GET NUMATTACH`](#name-get-numattach){.section-name .selfRef} {#name-get-numattach}

Retrieve the count kept by the Attachment Daemon of all the *active*
systems protected by this UPS.[¶](#section-4.2.4.3-1){.pilcrow}

Command: `GET NUMATTACH <upsname>`[¶](#section-4.2.4.3-2){.pilcrow}

Response: `NUMATTACH <upsname> <value>`[¶](#section-4.2.4.3-3){.pilcrow}

`<value>` is a count of the Primary and the number of Secondaries
currently powered by this UPS.[¶](#section-4.2.4.3-4){.pilcrow}

For example: command `GET ATTACH su700` and response
`NUMATTACH su700 1`[¶](#section-4.2.4.3-5){.pilcrow}

This information is needed by the Management Daemon to determine how
many Secondaries are still connected during the system shutdown
process.[¶](#section-4.2.4.3-6){.pilcrow}

Note: Historically, this subcommand was known as `NUMLOGINS`. Since
`LOGIN` was not the conventional user access to a shell or program, the
name was changed to avoid confusion.[¶](#section-4.2.4.3-7.1){.pilcrow}
:::
:::

::: {#type}
::: {#section-4.2.4.4 .section}
##### [4.2.4.4.](#section-4.2.4.4){.section-number .selfRef} [`GET TYPE`](#name-get-type){.section-name .selfRef} {#name-get-type}

Retrieve the type of a UPS variable. See [Section
2.11](#var){.xref}.[¶](#section-4.2.4.4-1){.pilcrow}

Command: `GET TYPE <upsname> <varname>`[¶](#section-4.2.4.4-2){.pilcrow}

Response:
`TYPE <upsname> <varname> <type>...`[¶](#section-4.2.4.4-3){.pilcrow}

`<type>...` can be one or more of the following tokens. Multiple types
may be returned.[¶](#section-4.2.4.4-4){.pilcrow}

For example: command `GET TYPE su700 input.transfer.low` and response
`TYPE su700 input.transfer.low ENUM`[¶](#section-4.2.4.4-5){.pilcrow}

[]{#name-variable-types}

      Type       Meaning
  -------------- ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  RW             This is a read/write variable. It may be read with command `GET VAR` (see [Section 4.2.4.6](#getvar){.xref}) and set to a different value with command `SET` (see [Section 4.2.11](#set){.xref}).
  ENUM           This is an enumerated type, which supports specific predetermined values.
  STRING:n       This is a string of maximum length `n`.
  RANGE          This is a number, either integer or float, comprised in the range that may be seen with the command `LIST RANGE` (see [Section 4.2.7.4](#range){.xref}).[¶](#section-4.2.4.4-6.2.4.2.1){.pilcrow}
  NUMBER         This is a single numeric value, either integer or float.

  : [Table 1](#table-1){.selfRef}: [Variable
  Types](#name-variable-types){.selfRef}

Notes:[¶](#section-4.2.4.4-7){.pilcrow}

-   [ENUM, STRING:n, and RANGE are usually associated with RW but not
    always. The default \<type>, when omitted, is numeric, so either
    integer or float. Each Driver is then responsible for handling
    values as either integer or
    float.[¶](#section-4.2.4.4-8.1){.pilcrow}]{#section-4.2.4.4-8.1}
-   [Current practice is to represent floating point values using a
    decimal (base 10) English-based representation. Hexadecimals,
    exponents, and commas used as separators for thousands are not
    allowed. For example, \"1200.20\" is valid, while \"1,200.20\" and
    \"1200,20\" are not
    valid.[¶](#section-4.2.4.4-8.2){.pilcrow}]{#section-4.2.4.4-8.2}
:::
:::

::: {#upsdesc}
::: {#section-4.2.4.5 .section}
##### [4.2.4.5.](#section-4.2.4.5){.section-number .selfRef} [`GET UPSDESC`](#name-get-upsdesc){.section-name .selfRef} {#name-get-upsdesc}

Retrieve a text description of a UPS.[¶](#section-4.2.4.5-1){.pilcrow}

Command: `GET UPSDESC <upsname>`[¶](#section-4.2.4.5-2){.pilcrow}

Response:
`UPSDESC <upsname> "<description>"`[¶](#section-4.2.4.5-3){.pilcrow}

\<description> is defined by the Attachment Daemon configuration. If it
is not set, current practice is for the Attachment Daemon to return
\"Unavailable\".[¶](#section-4.2.4.5-4){.pilcrow}

For example: command `GET UPSDESC su700` and response
`UPSDESC su700 "Development box"`[¶](#section-4.2.4.5-5){.pilcrow}

This can be used to provide human-readable descriptions, instead of a
cryptic `ups@hostname` string.[¶](#section-4.2.4.5-6){.pilcrow}
:::
:::

::: {#getvar}
::: {#section-4.2.4.6 .section}
##### [4.2.4.6.](#section-4.2.4.6){.section-number .selfRef} [`GET VAR`](#name-get-var){.section-name .selfRef} {#name-get-var}

Retrieve the value of a UPS variable. See [Section
2.11](#var){.xref}.[¶](#section-4.2.4.6-1){.pilcrow}

Command: `GET VAR <upsname> <varname>`[¶](#section-4.2.4.6-2){.pilcrow}

Response:
`VAR <upsname> <varname> "<value>"`[¶](#section-4.2.4.6-3){.pilcrow}

For example: command `GET VAR su700 ups.status` and response
`VAR su700 ups.status "OB LB"`[¶](#section-4.2.4.6-4){.pilcrow}
:::
:::
:::
:::

::: {#help}
::: {#section-4.2.5 .section}
#### [4.2.5.](#section-4.2.5){.section-number .selfRef} [`HELP`](#name-help){.section-name .selfRef} {#name-help}

Return a list of the commands supported by the Attachment Daemon. This
command is intended for human, as well as program,
use.[¶](#section-4.2.5-1){.pilcrow}

Command: `HELP`[¶](#section-4.2.5-2){.pilcrow}

For example: the following command line sequence executed on an
Attachment Daemon[¶](#section-4.2.5-3){.pilcrow}

::: {#section-4.2.5-4}
``` {.lang-shell .sourcecode}
netcat localhost 3493
HELP
Commands: HELP VER GET LIST SET INSTCMD ATTACH DETACH
    USERNAME PASSWORD STARTTLS
```

[¶](#section-4.2.5-4){.pilcrow}
:::

ABNF: See variable `help` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.5-5){.pilcrow}

Note: Historically, this command also returned `LOGIN` and `LOGOUT`.
Because `LOGIN` was not the conventional user access to a shell or
program, the command names were changed to `ATTACH` and `DETACH` to
avoid confusion.[¶](#section-4.2.5-6.1){.pilcrow}
:::
:::

::: {#instcmd}
::: {#section-4.2.6 .section}
#### [4.2.6.](#section-4.2.6){.section-number .selfRef} [`INSTCMD`](#name-instcmd){.section-name .selfRef} {#name-instcmd}

Send an Instant Command to the UPS.[¶](#section-4.2.6-1){.pilcrow}

Command: `INSTCMD <upsname> <cmdname>`[¶](#section-4.2.6-2){.pilcrow}

`<upsname>` is the name of the UPS, and `<cmdname>` is the Instant
Command to be issued to that UPS. See [Appendix
A.3](#instcmdexamples){.xref} for examples of Instant
Commands.[¶](#section-4.2.6-3){.pilcrow}

If the command succeeds, the response is `OK`; otherwise, see the error
responses in [Section
4.3.2](#errorresponses){.xref}.[¶](#section-4.2.6-4){.pilcrow}

For example: command `INSTCMD su700 test.panel.start` and response
`OK`[¶](#section-4.2.6-5){.pilcrow}

ABNF: See variable `instcmd` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.6-6){.pilcrow}
:::
:::

::: {#list}
::: {#section-4.2.7 .section}
#### [4.2.7.](#section-4.2.7){.section-number .selfRef} [`LIST`](#name-list){.section-name .selfRef} {#name-list}

All the `LIST` commands produce a response with a common format. The
response begins with `BEGIN LIST` and then repeats the initial query. A
list then follows, with as many lines as are necessary. The response
ends with `END LIST`, followed by the initial
query.[¶](#section-4.2.7-1){.pilcrow}

The formatting may seem a bit redundant, but it makes a different form
of client possible. A client can send a `LIST` command and then wait for
the response. When it arrives, the Management Daemon doesn\'t need a
complicated state machine to remember which list is
which.[¶](#section-4.2.7-2){.pilcrow}

Note: The current NUT Project implementation of the Attachment Daemon,
`upsd`, sends back the response to the `LIST` command as a sequence of
messages. The Management Daemon should continue reading these messages
until it receives the line beginning
`END LIST`.[¶](#section-4.2.7-3){.pilcrow}

ABNF: See the variable `list` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.7-4){.pilcrow}

The possible subcommands are listed in the sections
below.[¶](#section-4.2.7-5){.pilcrow}

::: {#client}
::: {#section-4.2.7.1 .section}
##### [4.2.7.1.](#section-4.2.7.1){.section-number .selfRef} [`LIST CLIENT`](#name-list-client){.section-name .selfRef} {#name-list-client}

The command calls for the Attachment Daemon to report all the current
Management Daemon clients of a given
UPS.[¶](#section-4.2.7.1-1){.pilcrow}

Command: `LIST CLIENT <upsname>`[¶](#section-4.2.7.1-2){.pilcrow}

Response:[¶](#section-4.2.7.1-3){.pilcrow}

::: {#section-4.2.7.1-4}
``` {.lang-shell .sourcecode}
BEGIN LIST CLIENT <upsname>
CLIENT <upsname> <client_IP_address>
...
END LIST CLIENT <upsname>
```

[¶](#section-4.2.7.1-4){.pilcrow}
:::

For example: command `LIST CLIENT ups1` and
response[¶](#section-4.2.7.1-5){.pilcrow}

::: {#section-4.2.7.1-6}
``` {.lang-shell .sourcecode}
BEGIN LIST CLIENT ups1
CLIENT ups1 ::1
CLIENT ups1 203.0.113.1
END LIST CLIENT ups1
```

[¶](#section-4.2.7.1-6){.pilcrow}
:::
:::
:::

::: {#cmd}
::: {#section-4.2.7.2 .section}
##### [4.2.7.2.](#section-4.2.7.2){.section-number .selfRef} [`LIST CMD`](#name-list-cmd){.section-name .selfRef} {#name-list-cmd}

The command calls for the Attachment Daemon to report a list of the
Instant Commands that the Management Daemon may send to the Attachment
Daemon. This Instant Command list is the abstracted view of the UPS
hardware capabilities. An economical UPS will support few or no Instant
Commands, but a professional model should support
more.[¶](#section-4.2.7.2-1){.pilcrow}

Command: `LIST CMD <upsname>`[¶](#section-4.2.7.2-2){.pilcrow}

Response:[¶](#section-4.2.7.2-3){.pilcrow}

::: {#section-4.2.7.2-4}
``` {.lang-shell .sourcecode}
BEGIN LIST CMD <upsname>
CMD <upsname> <cmdname>
...
END LIST CMD <upsname>
```

[¶](#section-4.2.7.2-4){.pilcrow}
:::

`<upsname>` is the name of the UPS, and `<cmdname>` is the name of the
Instant Command that may be issued to the
UPS.[¶](#section-4.2.7.2-5){.pilcrow}

For example: command `LIST CMD su700` and
response[¶](#section-4.2.7.2-6){.pilcrow}

::: {#section-4.2.7.2-7}
``` {.lang-shell .sourcecode}
BEGIN LIST CMD su700
CMD su700 load.on
CMD su700 test.panel.start
...
END LIST CMD su700
```

[¶](#section-4.2.7.2-7){.pilcrow}
:::
:::
:::

::: {#enum}
::: {#section-4.2.7.3 .section}
##### [4.2.7.3.](#section-4.2.7.3){.section-number .selfRef} [`LIST ENUM`](#name-list-enum){.section-name .selfRef} {#name-list-enum}

The command calls for the Attachment Daemon to report the set of
possible values of a UPS variable that has predetermined
values.[¶](#section-4.2.7.3-1){.pilcrow}

Command:
`LIST ENUM <upsname> <varname>`[¶](#section-4.2.7.3-2){.pilcrow}

Response:[¶](#section-4.2.7.3-3){.pilcrow}

::: {#section-4.2.7.3-4}
``` {.lang-shell .sourcecode}
BEGIN LIST ENUM <upsname> <varname>
ENUM <upsname> <varname> "<value>"
...
END LIST ENUM <upsname> <varname>
```

[¶](#section-4.2.7.3-4){.pilcrow}
:::

`<upsname>` is the name of the UPS, `<varname>` is the UPS variable, and
`<value>` is one of the possible values of that UPS variable. Note that,
in current practice, the output is an unordered list. Also note that the
quotation marks are part of the
response.[¶](#section-4.2.7.3-5){.pilcrow}

For example: command `LIST ENUM su700 input.transfer.low` and
response[¶](#section-4.2.7.3-6){.pilcrow}

::: {#section-4.2.7.3-7}
``` {.lang-shell .sourcecode}
BEGIN LIST ENUM su700 input.transfer.low
ENUM su700 input.transfer.low "103"
ENUM su700 input.transfer.low "100"
...
END LIST ENUM su700 input.transfer.low
```

[¶](#section-4.2.7.3-7){.pilcrow}
:::
:::
:::

::: {#range}
::: {#section-4.2.7.4 .section}
##### [4.2.7.4.](#section-4.2.7.4){.section-number .selfRef} [`LIST RANGE`](#name-list-range){.section-name .selfRef} {#name-list-range}

The command calls for the Attachment Daemon to report the interval in
which valid values of UPS variable lie.[¶](#section-4.2.7.4-1){.pilcrow}

Command:
`LIST RANGE <upsname> <varname>`[¶](#section-4.2.7.4-2){.pilcrow}

Response:[¶](#section-4.2.7.4-3){.pilcrow}

::: {#section-4.2.7.4-4}
``` {.lang-shell .sourcecode}
BEGIN LIST RANGE <upsname> <varname>
RANGE <upsname> <varname> "<min>" "<max>"
...
END LIST RANGE <upsname> <varname>
```

[¶](#section-4.2.7.4-4){.pilcrow}
:::

`<upsname>` is the name of the UPS, `<varname>` is the UPS variable, and
{`<min>`,`<max>`} is the interval of valid values of that UPS variable.
Note that the quotation marks are part of the
response.[¶](#section-4.2.7.4-5){.pilcrow}

For example: command `LIST RANGE su700 input.transfer.low` and
response[¶](#section-4.2.7.4-6){.pilcrow}

::: {#section-4.2.7.4-7}
``` {.lang-shell .sourcecode}
BEGIN LIST RANGE su700 input.transfer.low
RANGE su700 input.transfer.low "90" "105"
END LIST RANGE su700 input.transfer.low
```

[¶](#section-4.2.7.4-7){.pilcrow}
:::
:::
:::

::: {#listrw}
::: {#section-4.2.7.5 .section}
##### [4.2.7.5.](#section-4.2.7.5){.section-number .selfRef} [`LIST RW`](#name-list-rw){.section-name .selfRef} {#name-list-rw}

The command calls for the Attachment Daemon to report a list of the UPS
variables associated with a given UPS that may be read and written by
the Management Daemon. These variables are the abstracted view of the
UPS hardware capabilities. An economical UPS may support few variables,
but a professional model should support at least the variables that are
needed for an automatic shutdown and restart; see [Appendix
B](#shutdownstory){.xref}. Also, see [Section 8.2](#MinSup){.xref} for
details of the recommended minimum support of variables. A full list of
variables is available in [source code file
docs/nut-names.txt](#gitvars){.xref} \[[gitvars](#gitvars){.xref}\],
which serves as the Recording Document.[¶](#section-4.2.7.5-1){.pilcrow}

Command: `LIST RW <upsname>`[¶](#section-4.2.7.5-2){.pilcrow}

Response:[¶](#section-4.2.7.5-3){.pilcrow}

::: {#section-4.2.7.5-4}
``` {.lang-shell .sourcecode}
BEGIN LIST RW <upsname>
RW <upsname> <varname> "<value>"
...
END LIST RW <upsname>
```

[¶](#section-4.2.7.5-4){.pilcrow}
:::

`<upsname>` is the name of the UPS, `<varname>` is the UPS variable, and
`<value>` is the value of that UPS variable. Note that the quotation
marks are part of the response.[¶](#section-4.2.7.5-5){.pilcrow}

For example: command `LIST RW su700` and
response[¶](#section-4.2.7.5-6){.pilcrow}

::: {#section-4.2.7.5-7}
``` {.lang-shell .sourcecode}
BEGIN LIST RW su700
RW su700 output.voltage.nominal "115"
RW su700 ups.delay.shutdown "020"
...
END LIST RW su700
```

[¶](#section-4.2.7.5-7){.pilcrow}
:::
:::
:::

::: {#ups}
::: {#section-4.2.7.6 .section}
##### [4.2.7.6.](#section-4.2.7.6){.section-number .selfRef} [`LIST UPS`](#name-list-ups){.section-name .selfRef} {#name-list-ups}

The command calls for the Attachment Daemon to report a list of the UPS
units to which it is attached.[¶](#section-4.2.7.6-1){.pilcrow}

Command: `LIST UPS`[¶](#section-4.2.7.6-2){.pilcrow}

Response:[¶](#section-4.2.7.6-3){.pilcrow}

::: {#section-4.2.7.6-4}
``` {.lang-shell .sourcecode}
BEGIN LIST UPS
UPS <upsname> "<description>"
...
END LIST UPS
```

[¶](#section-4.2.7.6-4){.pilcrow}
:::

`<upsname>` is the name of a UPS, and `<description>` is the description
maintained by the Attachment Daemon, if available. It is set to
\"Unavailable\" otherwise. Note that the quotation marks are part of the
response.[¶](#section-4.2.7.6-5){.pilcrow}

This command can also be used to determine what values of `<upsname>`
are valid before calling other functions on the server. This is also a
good way to handle situations where a single Attachment Daemon supports
multiple UPSs. It is also useful for clients that perform a UPS
discovery process.[¶](#section-4.2.7.6-6){.pilcrow}

For example: response[¶](#section-4.2.7.6-7){.pilcrow}

::: {#section-4.2.7.6-8}
``` {.lang-shell .sourcecode}
BEGIN LIST UPS
UPS su700 "Development box"
END LIST UPS
```

[¶](#section-4.2.7.6-8){.pilcrow}
:::
:::
:::

::: {#listvar}
::: {#section-4.2.7.7 .section}
##### [4.2.7.7.](#section-4.2.7.7){.section-number .selfRef} [`LIST VAR`](#name-list-var){.section-name .selfRef} {#name-list-var}

The command calls for the Attachment Daemon to report a list of all the
UPS variables that it maintains for a given UPS and the values of those
UPS variables.[¶](#section-4.2.7.7-1){.pilcrow}

Command: `LIST VAR <upsname>`[¶](#section-4.2.7.7-2){.pilcrow}

Response:[¶](#section-4.2.7.7-3){.pilcrow}

::: {#section-4.2.7.7-4}
``` {.lang-shell .sourcecode}
BEGIN LIST VAR <upsname>
VAR <upsname> <varname> "<value>"
...
END LIST VAR <upsname>
```

[¶](#section-4.2.7.7-4){.pilcrow}
:::

`<upsname>` is the name of the UPS, `<varname>` is the UPS variable, and
`<value>` is the value of that variable. Note that the quotation marks
are part of the response.[¶](#section-4.2.7.7-5){.pilcrow}

The response to this command lists the UPS variables available for this
UPS and their current values.[¶](#section-4.2.7.7-6){.pilcrow}

For example: command `LIST VAR su700` and
response[¶](#section-4.2.7.7-7){.pilcrow}

::: {#section-4.2.7.7-8}
``` {.lang-shell .sourcecode}
BEGIN LIST VAR su700
VAR su700 ups.mfr "Example Mfg"
VAR su700 ups.mfr.date "10/17/96"
...
END LIST VAR su700
```

[¶](#section-4.2.7.7-8){.pilcrow}
:::

See [Section 8.2](#MinSup){.xref} for details of the recommended minimum
support of variables. A full list of variables is available in [source
code file docs/nut-names.txt](#gitvars){.xref}
\[[gitvars](#gitvars){.xref}\], which serves as the Recording
Document.[¶](#section-4.2.7.7-9){.pilcrow}
:::
:::
:::
:::

::: {#password}
::: {#section-4.2.8 .section}
#### [4.2.8.](#section-4.2.8){.section-number .selfRef} [`PASSWORD`](#name-password){.section-name .selfRef} {#name-password}

This command is a companion to `USERNAME` and is used by a Management
Daemon to specify the password required to enter a session with the
Attachment Daemon; see [Section
2.9](#sess){.xref}.[¶](#section-4.2.8-1){.pilcrow}

Command: `PASSWORD <password>`[¶](#section-4.2.8-2){.pilcrow}

If the command succeeds, the response is `OK`; otherwise, see the error
responses in [Section
4.3.2](#errorresponses){.xref}.[¶](#section-4.2.8-3){.pilcrow}

For examples of the use of commands `USERNAME` and `PASSWORD` by
administrative users, see [Appendix
E.2](#adsecclient){.xref}.[¶](#section-4.2.8-4){.pilcrow}

ABNF: See variable `session-password` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.8-5){.pilcrow}
:::
:::

::: {#primary}
::: {#section-4.2.9 .section}
#### [4.2.9.](#section-4.2.9){.section-number .selfRef} [`PRIMARY`](#name-primary-2){.section-name .selfRef} {#name-primary-2}

In current practice, the Attachment Daemon records in local file
`upsd.users` that an administrative user is a Primary. See [Appendix
E.1](#adminuser){.xref} for an example. When a Management Daemon starts
up and opens a session with the Attachment Daemon, it lays claim to
being a Primary by sending command `PRIMARY` to the Attachment Daemon,
thus claiming that it has the required authority to perform critical
actions, such as setting status symbol
`FSD`.[¶](#section-4.2.9-1){.pilcrow}

Command: `PRIMARY <upsname>`[¶](#section-4.2.9-2){.pilcrow}

`<upsname>` is the name of the UPS.[¶](#section-4.2.9-3){.pilcrow}

If the Attachment Daemon has the authority, the response is `OK`;
otherwise, see the error responses in [Section
4.3.2](#errorresponses){.xref}.[¶](#section-4.2.9-4){.pilcrow}

Note: Historically, this command was known as
`MASTER`.[¶](#section-4.2.9-5.1){.pilcrow}
:::
:::

::: {#protver}
::: {#section-4.2.10 .section}
#### [4.2.10.](#section-4.2.10){.section-number .selfRef} [`PROTVER`](#name-protver){.section-name .selfRef} {#name-protver}

Return the version of the command/response protocol used by the
Attachment Daemon. This command is intended for human, as well as
program, use.[¶](#section-4.2.10-1){.pilcrow}

Command: `PROTVER`[¶](#section-4.2.10-2){.pilcrow}

For example: the following command line sequence in the Attachment
Daemon[¶](#section-4.2.10-3){.pilcrow}

::: {#section-4.2.10-4}
``` {.lang-shell .sourcecode}
netcat localhost 3493
PROTVER
1.3
```

[¶](#section-4.2.10-4){.pilcrow}
:::

Notes:[¶](#section-4.2.10-5){.pilcrow}

1.  [There are no quotation marks in the
    response.[¶](#section-4.2.10-6.1){.pilcrow}]{#section-4.2.10-6.1}
2.  [The version of the protocol returned by `PROTVER` is different than
    the implementation version of the Attachment Daemon returned by
    `VER`.[¶](#section-4.2.10-6.2){.pilcrow}]{#section-4.2.10-6.2}
3.  [To ease migration, NUT version 2.8.0 also supports the equivalent
    `NETVER` command used in previous releases. See [Section
    8.2.4](#Version.2.7.4){.xref}.[¶](#section-4.2.10-6.3){.pilcrow}]{#section-4.2.10-6.3}

ABNF: See variable `protver` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.10-7){.pilcrow}
:::
:::

::: {#set}
::: {#section-4.2.11 .section}
#### [4.2.11.](#section-4.2.11){.section-number .selfRef} [`SET`](#name-set){.section-name .selfRef} {#name-set}

The command calls for the Attachment Daemon to set a UPS variable to a
given value. Whether this has an effect on the UPS hardware is specific
to the Driver and the UPS model. Some variables are read-only due to the
design of the UPS or its Driver.[¶](#section-4.2.11-1){.pilcrow}

Command:
`SET VAR <upsname> <varname> "<value>"`[¶](#section-4.2.11-2){.pilcrow}

`<upsname>` is the name of the UPS, `<varname>` is the UPS variable, and
`<value>` is the value to be assigned to that variable. Note that the
quotation marks are part of the command.[¶](#section-4.2.11-3){.pilcrow}

If the command succeeds, the response is `OK`; otherwise, see the error
responses in [Section
4.3.2](#errorresponses){.xref}.[¶](#section-4.2.11-4){.pilcrow}

For example: command `SET VAR su700 ups.id "My UPS"` and response
`OK`[¶](#section-4.2.11-5){.pilcrow}

ABNF: See the variable `set` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.11-6){.pilcrow}
:::
:::

::: {#starttls}
::: {#section-4.2.12 .section}
#### [4.2.12.](#section-4.2.12){.section-number .selfRef} [`STARTTLS`](#name-starttls){.section-name .selfRef} {#name-starttls}

The client tells the Attachment Daemon to switch to communication
encrypted by TLS \[[RFC8446](#RFC8446){.xref}\]. When the client
receives `OK`, it also switches to TLS
encryption.[¶](#section-4.2.12-1){.pilcrow}

Command: `STARTTLS`[¶](#section-4.2.12-2){.pilcrow}

If the command succeeds, the response is `OK STARTTLS`; otherwise, see
the error responses in [Section
4.3.2](#errorresponses){.xref}.[¶](#section-4.2.12-3){.pilcrow}

If the client does not send command STARTTLS to the Attachment Daemon,
communication continues unencrypted; however, an Attachment Daemon
[MAY]{.bcp14} refuse unencrypted
communication.[¶](#section-4.2.12-4){.pilcrow}

NUT 2.8.0 supports the encryption of communications between the
Attachment Daemon and the Management Daemon using TLS 1.3
\[[RFC8446](#RFC8446){.xref}\] with X.509 v3 certificates, as defined by
\[[RFC5280](#RFC5280){.xref}\] and updates. See [Appendix
D](#AppendixEavesdropping){.xref} for details of the encryption of
communications in previous release
2.7.4.[¶](#section-4.2.12-5){.pilcrow}

ABNF: See variable `starttls` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.12-6){.pilcrow}

::: {#selfsigned}
::: {#section-4.2.12.1 .section}
##### [4.2.12.1.](#section-4.2.12.1){.section-number .selfRef} [Key Infrastructure and Self-Signed Certificates](#name-key-infrastructure-and-self){.section-name .selfRef} {#name-key-infrastructure-and-self}

*The very restricted nature of UPS management makes it of interest to
consider self-signed certificates.*[¶](#section-4.2.12.1-1){.pilcrow}

In the World Wide Web, there are millions of servers and hundreds of
millions of potential clients for each one. The servers do not know who
their clients will be, so they entrust the management of a Public Key
Infrastructure (PKI) to Certificate Authorities that they trust. The
encryption of communications between the client and server requires that
the browsers carry a list of Certificate Authorities that the clients
have to trust. *This is a many-to-many
relationship.*[¶](#section-4.2.12.1-2){.pilcrow}

The management of UPS units is not a many-to-many relationship; it is
frequently one to one. In the closely restrained world of UPS
management, there are a very limited number of clients for each server,
rarely more than three, and unlike the World Wide Web, the server
administrators know exactly who they are. These clients visit very few
servers, typically one only. This situation is totally different from
the World Wide Web. The use of external Certificate Authorities is a
potential security weakness that must be accepted for the World Wide Web
but which can be avoided for UPS management by either generating the
private and public keys locally or, for larger organizations, using a
PKI.[¶](#section-4.2.12.1-3){.pilcrow}

The security policies for UPS management may be subordinate to an
organization\'s own internal IT security plans and procedures, possibly
based on \[[RFC7030](#RFC7030){.xref}\] and
\[[RFC8894](#RFC8894){.xref}\], but in simple cases, it is possible to
obtain better security using self-signed
certificates.[¶](#section-4.2.12.1-4){.pilcrow}
:::
:::
:::
:::

::: {#username}
::: {#section-4.2.13 .section}
#### [4.2.13.](#section-4.2.13){.section-number .selfRef} [`USERNAME`](#name-username){.section-name .selfRef} {#name-username}

The Attachment Daemon limits access to clients whose credentials match
those in the file `upsd.users`. There is no anonymous access. A
Management Daemon program or script uses command `USERNAME` and its
companion command `PASSWORD` to open a session with the Attachment
Daemon for an administrative user. Note that this command is for program
or script use and is not the familiar login command typed on a command
line to gain access to a shell.[¶](#section-4.2.13-1){.pilcrow}

Command: `USERNAME <username>`[¶](#section-4.2.13-2){.pilcrow}

If the command succeeds, the response is `OK`; otherwise, see the error
responses in [Section
4.3.2](#errorresponses){.xref}.[¶](#section-4.2.13-3){.pilcrow}

For examples of the use of commands `USERNAME` and `PASSWORD` by
administrative users, see [Appendix
E.2](#adsecclient){.xref}.[¶](#section-4.2.13-4){.pilcrow}

ABNF: See variable `session-username` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.13-5){.pilcrow}
:::
:::

::: {#ver}
::: {#section-4.2.14 .section}
#### [4.2.14.](#section-4.2.14){.section-number .selfRef} [`VER`](#name-ver){.section-name .selfRef} {#name-ver}

Return the implementation version of the Attachment Daemon. This command
is intended for human, as well as program,
use.[¶](#section-4.2.14-1){.pilcrow}

Command: `VER`[¶](#section-4.2.14-2){.pilcrow}

For example: the following command line
sequence[¶](#section-4.2.14-3){.pilcrow}

::: {#section-4.2.14-4}
``` {.lang-shell .sourcecode}
netcat localhost 3493
VER
Network UPS Tools upsd 2.8.0 - http://www.networkupstools.org/
```

[¶](#section-4.2.14-4){.pilcrow}
:::

Notes:[¶](#section-4.2.14-5){.pilcrow}

1.  [There are no quotation marks in the
    response.[¶](#section-4.2.14-6.1){.pilcrow}]{#section-4.2.14-6.1}
2.  [The implementation version of the Attachment Daemon returned by VER
    is different than the protocol version returned by
    `PROTVER`.[¶](#section-4.2.14-6.2){.pilcrow}]{#section-4.2.14-6.2}

ABNF: See variable `ver` in [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.2.14-7){.pilcrow}
:::
:::
:::
:::

::: {#responses}
::: {#section-4.3 .section}
### [4.3.](#section-4.3){.section-number .selfRef} [Summary of Responses](#name-summary-of-responses){.section-name .selfRef} {#name-summary-of-responses}

::: {#success}
::: {#section-4.3.1 .section}
#### [4.3.1.](#section-4.3.1){.section-number .selfRef} [Response When Command Succeeds](#name-response-when-command-succe){.section-name .selfRef} {#name-response-when-command-succe}

If the command succeeds, the response has the following
command-dependent form:[¶](#section-4.3.1-1){.pilcrow}

[]{#name-response-if-command-succeed}

  Command      Response              Reference                            Note
  ------------ --------------------- ------------------------------------ ------------
  `ATTACH`     `OK`                  [Section 4.2.1](#attach){.xref}      Was LOGIN
  `DETACH`     `OK Goodbye`          [Section 4.2.2](#detach){.xref}      Was LOGOUT
  `FSD`        `OK FSD-SET`          [Section 4.2.3](#FSD){.xref}         
  `GET`        Subcommand specific   [Section 4.2.4](#get){.xref}         
  `HELP`       List of commands      [Section 4.2.5](#help){.xref}        
  `INSTCMD`    `OK`                  [Section 4.2.6](#instcmd){.xref}     
  `LIST`       Subcommand specific   [Section 4.2.7](#list){.xref}        
  `PASSWORD`   `OK`                  [Section 4.2.8](#password){.xref}    
  `PRIMARY`    `OK`                  [Section 4.2.9](#primary){.xref}     
  `PROTVER`    Protocol version      [Section 4.2.10](#protver){.xref}    Was NETVER
  `SET`        `OK`                  [Section 4.2.11](#set){.xref}        
  `STARTTLS`   `OK STARTTLS`         [Section 4.2.12](#starttls){.xref}   
  `USERNAME`   `OK`                  [Section 4.2.13](#username){.xref}   
  `VER`        Program version       [Section 4.2.14](#ver){.xref}        

  : [Table 2](#table-2){.selfRef}: [Response If Command
  Succeeds](#name-response-if-command-succeed){.selfRef}
:::
:::

::: {#errorresponses}
::: {#section-4.3.2 .section}
#### [4.3.2.](#section-4.3.2){.section-number .selfRef} [Error Responses](#name-error-responses){.section-name .selfRef} {#name-error-responses}

Error responses have the following
format:[¶](#section-4.3.2-1){.pilcrow}

::: {#section-4.3.2-2}
``` {.lang-shell .sourcecode}
ERR <error-name> [<extra>]
```

[¶](#section-4.3.2-2){.pilcrow}
:::

`<error-name>` is a single word token taken from the 27 characters A-Z
and hyphen (-). Implementations [MAY]{.bcp14}, if needed, add an
additional, optional `<extra>`. Current practice does not make use of
this possibility.[¶](#section-4.3.2-3){.pilcrow}

The `<error-name>` may have one of the following
values:[¶](#section-4.3.2-4){.pilcrow}

[]{#name-error-responses-2}

::: {#errors}
+-----------------------------------+-----------------------------------+
|     The Error Name Token    \     | Meaning                           |
| `<error-name>`                    |                                   |
+===================================+===================================+
| `ACCESS-DENIED`                   | The client\'s host and/or         |
|                                   | authentication details supplied   |
|                                   | by `USERNAME` and `PASSWORD` are  |
|                                   | not sufficient to execute the     |
|                                   | requested command.                |
+-----------------------------------+-----------------------------------+
| `ALREADY-ATTACHED`                | The client has already sent a     |
|                                   | successful `ATTACH` command for a |
|                                   | given UPS and can\'t do it        |
|                                   | again.[¶](#s                      |
|                                   | ection-4.3.2-5.2.2.2.1){.pilcrow} |
+-----------------------------------+-----------------------------------+
| `ALREADY-SET-PASSWORD`            | The client has already supplied a |
|                                   | `PASSWORD` and is attempting to   |
|                                   | repeat the command in the same    |
|                                   | session.                          |
+-----------------------------------+-----------------------------------+
| `ALREADY-SET-USERNAME`            | The client has already supplied a |
|                                   | `USERNAME` and is attempting to   |
|                                   | repeat the command within the     |
|                                   | same session.                     |
+-----------------------------------+-----------------------------------+
| `CMD-NOT-SUPPORTED`               | The specified UPS doesn\'t        |
|                                   | support the Instant Command.      |
+-----------------------------------+-----------------------------------+
| `DATA-STALE`                      | The Attachment Daemon is          |
|                                   | connected to the Driver for the   |
|                                   | UPS, but that Driver isn\'t       |
|                                   | providing regular updates or has  |
|                                   | specifically marked the data as   |
|                                   | stale. Current practice is for    |
|                                   | the Attachment Daemon to refuse   |
|                                   | to provide the Management Daemon  |
|                                   | with variables on stale units to  |
|                                   | avoid false                       |
|                                   | readings.[¶](#s                   |
|                                   | ection-4.3.2-5.2.6.2.1){.pilcrow} |
|                                   |                                   |
|                                   | This generally means that the     |
|                                   | Driver is running, but it has     |
|                                   | lost communication with the       |
|                                   | hardware. Check the physical      |
|                                   | connection to the                 |
|                                   | equipment.[¶](#s                  |
|                                   | ection-4.3.2-5.2.6.2.2){.pilcrow} |
+-----------------------------------+-----------------------------------+
| `DRIVER-NOT-CONNECTED`            | The Attachment Daemon can\'t      |
|                                   | perform the requested command,    |
|                                   | since the Driver for that UPS is  |
|                                   | not connected. This usually means |
|                                   | that the Driver is not running    |
|                                   | or, if it is, is misconfigured.   |
+-----------------------------------+-----------------------------------+
| `FEATURE-NOT-CONFIGURED`          | This instance of the Attachment   |
|                                   | Daemon hasn\'t been configured    |
|                                   | properly to allow the requested   |
|                                   | feature to operate. In current    |
|                                   | practice, this error response is  |
|                                   | possible only for command         |
|                                   | `STARTTLS`.                       |
+-----------------------------------+-----------------------------------+
| `FEATURE-NOT-SUPPORTED`           | This instance of Attachment       |
|                                   | Daemon does not support the       |
|                                   | requested feature. In current     |
|                                   | practice, this error response is  |
|                                   | possible only for command         |
|                                   | `STARTTLS`.                       |
+-----------------------------------+-----------------------------------+
| `INSTCMD-FAILED`                  | The Attachment Daemon failed to   |
|                                   | deliver the Instant Command       |
|                                   | request to the Driver. No further |
|                                   | information is available to the   |
|                                   | client. This typically indicates  |
|                                   | a dead or broken Driver.          |
+-----------------------------------+-----------------------------------+
| `INVALID-ARGUMENT`                | The client sent an argument to a  |
|                                   | command that is not recognized or |
|                                   | is otherwise not valid in this    |
|                                   | context. This is typically caused |
|                                   | by sending a valid command, such  |
|                                   | as `GET`, with a subcommand that  |
|                                   | is not valid.                     |
+-----------------------------------+-----------------------------------+
| `INVALID-PASSWORD`                | The client sent a nonvalid        |
|                                   | `PASSWORD`.                       |
+-----------------------------------+-----------------------------------+
| `INVALID-USERNAME`                | The client sent a nonvalid        |
|                                   | `USERNAME`.                       |
+-----------------------------------+-----------------------------------+
| `INVALID-VALUE`                   | The value specified in the        |
|                                   | request is not valid. This        |
|                                   | usually applies to a `SET` of an  |
|                                   | `ENUM` type that is using a value |
|                                   | not in the list of allowed        |
|                                   | values. See [Section              |
|                                   | 4.2.7.3](#enum){.xref}.           |
+-----------------------------------+-----------------------------------+
| `PASSWORD-REQUIRED`               | The command requires a `PASSWORD` |
|                                   | for authentication, but the       |
|                                   | client hasn\'t provided one.      |
+-----------------------------------+-----------------------------------+
| `READONLY`                        | The requested variable in a `SET` |
|                                   | command is not writable.          |
+-----------------------------------+-----------------------------------+
| `SET-FAILED`                      | The Attachment Daemon failed to   |
|                                   | deliver the `SET` request to the  |
|                                   | Driver. This is similar to        |
|                                   | `INSTCMD-FAILED`.                 |
+-----------------------------------+-----------------------------------+
| `TLS-ALREADY-ENABLED`             | TLS mode is already enabled on    |
|                                   | this connection, so the           |
|                                   | Attachment Daemon can\'t start it |
|                                   | again.[¶](#se                     |
|                                   | ction-4.3.2-5.2.18.2.1){.pilcrow} |
|                                   |                                   |
|                                   | Note: Historically, this message  |
|                                   | was                               |
|                                   | `ALREADY-SSL-MODE.`[¶](#se        |
|                                   | ction-4.3.2-5.2.18.2.2){.pilcrow} |
+-----------------------------------+-----------------------------------+
| `TLS-NOT-ENABLED`                 | TLS mode is required but has not  |
|                                   | yet been enabled on this          |
|                                   | connection, so the Attachment     |
|                                   | Daemon can\'t send                |
|                                   | commands.[¶](#se                  |
|                                   | ction-4.3.2-5.2.19.2.1){.pilcrow} |
|                                   |                                   |
|                                   | Note: This message is             |
|                                   | experimental and not in current   |
|                                   | common                            |
|                                   | use.[¶](#se                       |
|                                   | ction-4.3.2-5.2.19.2.2){.pilcrow} |
+-----------------------------------+-----------------------------------+
| `TOO-LONG`                        | The requested value in a `SET`    |
|                                   | command is too long.              |
+-----------------------------------+-----------------------------------+
| `UNKNOWN-COMMAND`                 | The Attachment Daemon doesn\'t    |
|                                   | recognize the command.            |
+-----------------------------------+-----------------------------------+
| `UNKNOWN-UPS`                     | The UPS specified in the request  |
|                                   | is not known to the Attachment    |
|                                   | Daemon. This usually means that   |
|                                   | it didn\'t match anything in the  |
|                                   | Attachment Daemon configuration.  |
+-----------------------------------+-----------------------------------+
| `USERNAME-REQUIRED`               | The command requires a `USERNAME` |
|                                   | for authentication, but the       |
|                                   | client hasn\'t provided one.      |
+-----------------------------------+-----------------------------------+
| `VAR-NOT-SUPPORTED`               | The specified UPS doesn\'t        |
|                                   | support the UPS variable in the   |
|                                   | command.                          |
+-----------------------------------+-----------------------------------+

: [Table 3](#table-3){.selfRef}: [Error
Responses](#name-error-responses-2){.selfRef}
:::

Note: Historically, this error response was
`ALREADY-LOGGED-IN`.[¶](#section-4.3.2-6.1){.pilcrow}
:::
:::
:::
:::

::: {#ABNF}
::: {#section-4.4 .section}
### [4.4.](#section-4.4){.section-number .selfRef} [An ABNF of the Commands](#name-an-abnf-of-the-commands){.section-name .selfRef} {#name-an-abnf-of-the-commands}

This section repeats the syntax of [Section 4.2](#commands){.xref} but
in Augmented Backus-Naur Form (ABNF). It does not define any additional
features. For further details of each command and the response, see
[Section 4.2](#commands){.xref}.[¶](#section-4.4-1){.pilcrow}

The commands may be presented in ABNF \[[RFC5234](#RFC5234){.xref}\]
\[[RFC7405](#RFC7405){.xref}\] and represented using US-ASCII
\[[RFC0020](#RFC0020){.xref}\].[¶](#section-4.4-2){.pilcrow}

Current practice tolerates mixed-case command names, but it is
[RECOMMENDED]{.bcp14} to use uppercase only for commands. See [Figure
5](#fig.ABNF){.xref}.[¶](#section-4.4-3){.pilcrow}

[]{#name-abnf-for-the-commands}

::: {#fig.ABNF}
::: {#section-4.4-4.1}
``` {.breakable .lang-abnf .sourcecode}
;-------------------------------------------------------------------
; This grammar is case sensitive. Terminal keywords SHOULD be
; written in uppercase, as shown.
; The following basic rules written with uppercase names are
; taken from RFC 5234, Appendix B.1.
   SP = 1*%x20                  ; At least one SPACE
   LF = %x0A                    ; Linefeed
   DIGIT = %x30-39              ; Digit 0 through 9
   ALPHA =  %x41-5A / %x61-7A   ; A-Z / a-z
   DQUOTE = %x22                ; Double quote "
   VCHAR = %x21-7E              ; Visible (printing) characters
; Additional basic rules needed by this grammar
   LC = %x61-7A                 ; Letter a through z
   DOT = 1%x2E                  ; Exactly one .
   COLON = 1%x3A                ; Exactly one :
   AT = 1%x40                   ; Exactly one @
   SEP = 1"-" / 1"_" / 1"."     ; A single - or _ or .
   JOIN = COLON / AT            ; A single : or @
; Frequently used in this grammar
   cmdname = 1*LC *62(DOT 1*LC) ; E.g., load.off.delay
   upschar = DIGIT / ALPHA / SEP
   ups = 1*ALPHA *62upschar     ; E.g., Example-Mfg-999
   group = ups                  ; E.g., HB  (Not in common use)
   hostname = ups               ; E.g., example.com
   port = 1*5DIGIT              ; E.g., 3493
   upsname = [group COLON] ups [AT hostname [COLON port]]
                                ; Fully Qualified UPS name
                                ; E.g.,
                                ; HB:heartbeat1@example.com:3493
   username = ups               ; E.g., Power-Dept.6
   varname = 1*LC *62( DOT 1*(DIGIT / LC) )
                                ; E.g., outlet.1.status
;-------------------------------------------------------------------
   commandLine = command LF     ; LF is a single %x0A
   command = attach / detach / fsd / get / help / instcmd /
             list / password / primary / protver / set /
             starttls / username / ver
;
   attach  = "ATTACH" SP upsname
;
   detach = "DETACH"
;
   fsd = "FSD" SP upsname
;
   get = "GET" SP getsubcommnd
   getsubcommand = getcmddesc / getdesc / getnumattach /
                   gettype / getupsdesc / getvar
;
   getcmddesc =   "CMDDESC" SP upsname SP cmdname
   getdesc =      "DESC" SP upsname SP varname
   getnumattach = "NUMATTACH" SP upsname
   gettype =      "TYPE" SP upsname SP varname
   getupsdesc =   "UPSDESC" SP upsname
   getvar =       "VAR" SP upsname SP varname
;
   help = "HELP"
;
   instcmd = "INSTCMD" SP upsname SP cmdname
;
   list = "LIST" listsubcommand
   listsubcommand = listclient / listcmd / listenum / listrange /
                    listrw / listups / listvar
;
   listclient = "CLIENT" SP upsname
   listcmd =    "CMD" SP upsname
   listenum =   "ENUM" SP upsname SP varname
   listrange =  "RANGE" SP upsname SP varname
   listrw =     "RW" SP upsname
   listups =    "UPS"
   listvar =    "VAR" SP upsname
;
   session-password = "PASSWORD" SP *63VCHAR
                         ; A sequence of printable characters defined
                         ; in a server configuration file.  Local
                         ; security practices may mandate a minimum
                         ; and maximum number of characters.
;
   primary = "PRIMARY" SP upsname
;
   protver = "PROTVER"
;
   value = *63VCHAR      ; Local practices may limit the choice of
                         ; characters and require non-US-ASCII.
   set = "SET" SP %s"VAR" SP upsname SP varname SP
         DQUOTE value DQUOTE
;
   starttls = "STARTTLS"
;
   session-username = "USERNAME" SP username
;
   ver = "VER"
;-------------------------------------------------------------------
```
:::

[Figure 5](#figure-5){.selfRef}: [ABNF for the
Commands](#name-abnf-for-the-commands){.selfRef}
:::

Notes:[¶](#section-4.4-5){.pilcrow}

1.  [*Implementation note:* The ABNF is written using the provisions of
    \[[RFC5234](#RFC5234){.xref}\] and \[[RFC7405](#RFC7405){.xref}\],
    which are [US-ASCII based](#RFC0020){.xref}
    \[[RFC0020](#RFC0020){.xref}\].[¶](#section-4.4-6.1){.pilcrow}]{#section-4.4-6.1}
2.  [The grammar is case sensitive. The terminal key words
    [SHOULD]{.bcp14} be written in uppercase, as
    specified.[¶](#section-4.4-6.2){.pilcrow}]{#section-4.4-6.2}
3.  [The repetition factor in front of an expression has the form
    \<min>\*\<max>, where \<min> is the minimum number of repetitions,
    and \<max> is the maximum
    number.[¶](#section-4.4-6.3){.pilcrow}]{#section-4.4-6.3}
4.  [If \<min> is omitted, its value is 0. If \<max> is omitted, its
    value is infinity.[¶](#section-4.4-6.4){.pilcrow}]{#section-4.4-6.4}
5.  [The notation `n*n`, meaning \"exactly n copies\", may be written as
    `n`.[¶](#section-4.4-6.5){.pilcrow}]{#section-4.4-6.5}
6.  [Square brackets around an expression mean that the expression is
    optional. This could be written as
    `0*1`.[¶](#section-4.4-6.6){.pilcrow}]{#section-4.4-6.6}

::: {#ABNF-resp}
::: {#section-4.4.1 .section}
#### [4.4.1.](#section-4.4.1){.section-number .selfRef} [Responses to Commands](#name-responses-to-commands){.section-name .selfRef} {#name-responses-to-commands}

The responses to the commands are encoded in [US-ASCII](#RFC0020){.xref}
\[[RFC0020](#RFC0020){.xref}\] and fall into two
groups:[¶](#section-4.4.1-1){.pilcrow}

1.  [Short replies to action commands; see [Section
    4.3](#responses){.xref}.[¶](#section-4.4.1-2.1){.pilcrow}]{#section-4.4.1-2.1}
2.  [Long replies to requests for information. In this case, the reply
    is sent in a sequence of messages. The last message will contain a
    line beginning `END LIST` . For example, see [Section
    4.2.7.1](#client){.xref}.[¶](#section-4.4.1-2.2){.pilcrow}]{#section-4.4.1-2.2}
:::
:::
:::
:::
:::
:::

::: {#section-5 .section}
## [5.](#section-5){.section-number .selfRef} [Statuses and Events](#name-statuses-and-events){.section-name .selfRef} {#name-statuses-and-events}

::: {#symbols}
::: {#section-5.1 .section}
### [5.1.](#section-5.1){.section-number .selfRef} [Status Symbols](#name-status-symbols){.section-name .selfRef} {#name-status-symbols}

These symbols resume the abstracted view of the UPS hardware maintained
by the Attachment Daemon. The variable `ups.status` contains one or more
space-separated status symbols, which together describe the UPS state at
that instant. In current practice, the Management Daemon will poll
variable `ups.status` every 5 seconds with a command, such as
`GET VAR su700 ups.status`, and a response, such as
`VAR su700 ups.status "OB LB"`, to discover changes in the UPS status.
These changes will indicate UPS events.[¶](#section-5.1-1){.pilcrow}

[]{#name-ups-status-symbols}

  Status Symbol   Meaning
  --------------- ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  `ALARM`         The UPS reports that it requires intervention.
  `BOOST`         The UPS has determined that the voltage level of the public power supply is too low and is boosting it to the required level. The UPS continues to supply the protected system from the public power supply.
  `BYPASS`        The UPS is feeding current directly from the public power supply to the protected system. The backup facilities are disconnected. This state allows maintenance personnel to change the batteries without interrupting the protected system.
  `CAL`           The UPS is calibrating itself, for example, to determine at what charge the `LB` status is raised or lowered.
  `CHRG`          The UPS battery is charging. This usually implies that the UPS also has status `OL` but may not be the case if the UPS also has status `OFF`.[¶](#section-5.1-2.2.5.2.1){.pilcrow}
  `COMM`          The Attachment Daemon has effective contact with the UPS.
  `DISCHRG`       The UPS battery is discharging. This usually implies that the UPS also has status `OB` but may not be the case if the UPS also has status `OFF`.[¶](#section-5.1-2.2.7.2.1){.pilcrow}
  `FSD`           This \"Forced Shutdown\" status signals that the final shutdown sequence has begun.
  `LB`            Low Battery. The battery level of the UPS is below a chosen limit. The UPS may be in status `OL` or `OB`.
  `NOCOMM`        The Attachment Daemon has no effective contact with the UPS.
  `OB`            On Battery. The UPS is taking energy from its battery. The battery is discharging. A UPS must have status `OB` or `OL`; otherwise, it is deemed dead.
  `OFF`           The UPS is in state \"Off\". It does not react to failure in the public power supply. The exact meaning depends on the model.
  `OL`            Online. The UPS is online, receiving energy from the public power supply. The battery is charging. A UPS must have status `OB` or `OL`; otherwise, it is deemed dead.
  `OVER`          Overloaded. The UPS reports that the load on it is beyond its normal operating maximum.
  `RB`            Replace battery. The UPS reports that its battery or batteries should be replaced.
  `TEST`          Under test. The UPS is currently undergoing a test that may have been requested manually or internally.
  `TICK`          Heartbeat. A software UPS in the Attachment Daemon provides a regular signal monitored by the Management Daemon as a way of verifying effective end-to-end management. `TICK` and `TOCK` are companions; they are considered experimental.
  `TOCK`          Heartbeat. See `TICK`
  `TRIM`          The UPS has determined that the voltage level of the public power supply is too high and is reducing it to the required level. The UPS continues to supply the protected system from the public power supply.

  : [Table 4](#table-4){.selfRef}: [UPS Status
  Symbols](#name-ups-status-symbols){.selfRef}
:::
:::

::: {#events}
::: {#section-5.2 .section}
### [5.2.](#section-5.2){.section-number .selfRef} [Events](#name-events){.section-name .selfRef} {#name-events}

A Management Daemon detects the occurrence of a UPS event from a change
in the UPS status received from the Attachment Daemon. The following
table summarizes the process. A status of \"none\" means that the status
symbol is not present in the variable
`ups.status`.[¶](#section-5.2-1){.pilcrow}

The Management Daemon should retrieve the variable `ups.status` from the
Attachment Daemon at regular intervals. If the interval is too short,
compute and network resources will be wasted, but if the interval is too
large, the Management Daemon risks missing short-lived changes in the
UPS status.[¶](#section-5.2-2){.pilcrow}

A default value of 5 seconds is [RECOMMENDED]{.bcp14}, but an
implementation [MAY]{.bcp14} make this value configurable. By default,
the \"old\" status is therefore the previous value retrieved 5 seconds
ago.[¶](#section-5.2-3){.pilcrow}

Current practice is for the Management Daemon to assign names to certain
events. These are shown in the table in
parentheses.[¶](#section-5.2-4){.pilcrow}

[]{#name-event-deduction-from-status}

  -----------------------------------------------------------------------------------------------
  Old Status New Status  Event                          Old Status  New Status Event
  ---------- ----------- ------------------- ---------- ----------- ---------- ------------------
  none       `ALARM`     Alarm on                       `ALARM`     none       Alarm off

  none       `BOOST`     Boosting voltage               `BOOST`     none       Not boosting

  none       `BYPASS`    Bypass on                      `BYPASS`    none       Bypass off

  none       `CAL`       Calibrating                    `CAL`       none       Not calibrating

  none       `CHRG`      Charging                       `CHRG`      none       Not charging

  none       `COMM`      UPS communicating\             `COMM`      none       See note
                         (event `COMMOK`)                                      [4](#DDD){.xref}

  none       `DISCHRG`   Discharging                    `DISCHRG`   none       Not discharging

  none       `FSD`       System shutdown\               `FSD`       none       Shutdown
                         (events `FSD`,                                        abandoned. See
                         `SHUTDOWN`)                                           note
                                                                               [1](#AAA){.xref}

  none       `LB`        Low battery. See               `LB`        none       Battery not low
                         note                                                  
                         [2](#BBB){.xref}                                      
                         (event `LOWBATT`)                                     

  none       `NOCOMM`    UPS dead? See note             `NOCOMM`    none       See note
                         [4](#DDD){.xref}\                                     [4](#DDD){.xref}
                         (events `COMMBAD`,                                    
                         `NOCOMM`)                                             

  none       `OFF`       UPS turned off                 `OFF`       none       UPS not turned off

  `OB`       `OL`        Receiving power\               `OL`        `OB`       Power lost\
                         (event `ONLINE`)                                      (event `ONBATT`)

  none       `OVER`      UPS overloaded                 `OVER`      none       Overload gone

  none       `RB`        Replace battery\               `RB`        none       Replacement
                         (event `REPLBATT`)                                    canceled

  none       `TEST`      Test starts                    `TEST`      none       Test finished

  none       `TICK`      Heartbeat event.               `TICK`      none       No heartbeat. See
                         See note                                              note
                         [3](#CCC){.xref}                                      [3](#CCC){.xref}

  none       `TOCK`      Heartbeat event.               `TOCK`      none       No heartbeat. See
                         See note                                              note
                         [3](#CCC){.xref}                                      [3](#CCC){.xref}

  none       `TRIM`      Trimming voltage               `TRIM`      none       Not trimming
  -----------------------------------------------------------------------------------------------

  : [Table 5](#table-5){.selfRef}: [Event Deduction from Status
  Changes](#name-event-deduction-from-status){.selfRef}

[]{.break}

Notes:

:   1.  ::: {#section-5.2-6.2.1.1}
        ::: {#AAA}
        Current practice does not include this event.[¶](#AAA){.pilcrow}
        :::
        :::

    2.  ::: {#section-5.2-6.2.1.2}
        ::: {#BBB}
        If the status `OB` is present, current practice takes Management
        Daemon reception of `LB` as an order to perform an emergency
        system shutdown.[¶](#BBB){.pilcrow}
        :::
        :::

    3.  ::: {#section-5.2-6.2.1.3}
        ::: {#CCC}
        The use of a software-defined UPS to provide a heartbeat is
        experimental and is not part of common current
        practice.[¶](#CCC){.pilcrow}
        :::
        :::

    4.  ::: {#section-5.2-6.2.1.4}
        ::: {#DDD}
        Current practice is the following: if the UPS has not responded
        for 15 seconds, the Management Daemon assumes that the UPS is
        *dead* (event `NOCOMM`), and if the last known `OL`/`OB` status
        was `OB`, a system shutdown (command `FSD`) is
        requested.[¶](#DDD){.pilcrow}
        :::
        :::

:   
:::
:::
:::

::: {#Sec}
::: {#section-6 .section}
## [6.](#section-6){.section-number .selfRef} [Security Considerations](#name-security-considerations){.section-name .selfRef} {#name-security-considerations}

::: {#weak}
::: {#section-6.1 .section}
### [6.1.](#section-6.1){.section-number .selfRef} [Current General Security Practice](#name-current-general-security-pr){.section-name .selfRef} {#name-current-general-security-pr}

Experience over the last 20 years shows that new UPS management software
releases are not frequent and, when installed, stay unmodified for some
years. This is probably because UPS management is a mature activity,
part of site management. A limited number of system administrators have
access to the UPS hardware and software and tend to assume a certain
\"security by obscurity\" since many installations have a configuration
like the one shown in [Figure 6](#fig.weak){.xref}, which uses port
3493/TCP (nut) between the two daemons running in the same system. The
traffic is often not encrypted, and when it is encrypted, it uses
deprecated early versions of SSL/TLS.[¶](#section-6.1-1){.pilcrow}

[]{#name-common-single-system-config}

::: {#fig.weak}
::: {#section-6.1-2.1 .alignCenter .art-ascii-art .art-text .artwork}
     ,-----,   ,--------------------,---------------------,
     | UPS |---|  Attachment   <-Commands     Management  |
     |     |===|    Daemon       Responses->    Daemon    |
     /-----\   '--------------------'---------------------'
                  Listens on
                 port 3493/TCP
                 for localhost
:::

[Figure 6](#figure-6){.selfRef}: [Common Single-System
Configuration](#name-common-single-system-config){.selfRef}
:::

This situation is now changing as low-cost processors become available,
costing significantly less than a UPS unit. This evolution makes it
interesting to shift to a configuration like the one shown in [Figure
7](#fig.weaker){.xref}, but it also exacerbates the security weakness of
[Figure 6](#fig.weak){.xref}, since the traffic between the daemons is
now over an exposed network.[¶](#section-6.1-3){.pilcrow}

[]{#name-integration-of-ups-and-atta}

::: {#fig.weaker}
::: {#section-6.1-4.1 .alignCenter .art-ascii-art .art-text .artwork}
     ,-----,------------,               ,--------------,
     | UPS - Attachment | <-Commands    |  Management  |
     |     |   Daemon   |   Responses-> |    Daemon    |
     /-----'------------\               '--------------'
             Listens on
            port 3493/TCP
:::

[Figure 7](#figure-7){.selfRef}: [Integration of UPS and Attachment
Daemon](#name-integration-of-ups-and-atta){.selfRef}
:::

These security issues raised by UPS management are those of the power
industry in general; they are addressed in detail in [IEC Technical
Specification 62351](#IEC62351-1){.xref}
\[[IEC62351-1](#IEC62351-1){.xref}\]. In addition to equipment security,
cyber security is now an essential
consideration.[¶](#section-6.1-5){.pilcrow}

Quoting from IEC 62351-1\[[IEC62351-1](#IEC62351-1){.xref}\],
Introduction to the standard, clause
5.2.3.5:[¶](#section-6.1-6){.pilcrow}

> With the computer systems for power operations presumably kept
> isolated from the Internet, many utility personnel do not see any
> reason for adding security measures to these systems. However, as
> clearly seen from these Subclauses, this may not be true anymore as
> networking becomes more prevalent and additional information access
> requirements grow.[¶](#section-6.1-7){.pilcrow}

In IEC 62351-1\[[IEC62351-1](#IEC62351-1){.xref}\], clause 5.3.5 lists
typical security attacks: Eavesdropping, Masquerade, Man-in-the-Middle,
Replay, and Resource Exhaustion. \[[RFC3552](#RFC3552){.xref}\] adds
message insertion/deletion/modification and denial of
service.[¶](#section-6.1-8){.pilcrow}

Let\'s look more closely at these
requirements:[¶](#section-6.1-9){.pilcrow}

-   [Eavesdropping; see [Section
    6.3.1](#Eavesdropping){.xref}[¶](#section-6.1-10.1){.pilcrow}]{#section-6.1-10.1}
-   [Man-in-the-Middle; see [Section
    6.3.2](#Man-in-the-Middle){.xref}[¶](#section-6.1-10.2){.pilcrow}]{#section-6.1-10.2}
-   [Masquerade; see [Section
    6.3.3](#Masquerade){.xref}[¶](#section-6.1-10.3){.pilcrow}]{#section-6.1-10.3}
-   [Message insertion, deletion, and modification; see [Section
    6.3.4](#Messageidm){.xref}[¶](#section-6.1-10.4){.pilcrow}]{#section-6.1-10.4}
-   [Replay; see [Section
    6.3.5](#Replay){.xref}[¶](#section-6.1-10.5){.pilcrow}]{#section-6.1-10.5}
-   [Resource Exhaustion and Denial of Service; see [Section
    6.3.6](#Exhaustion){.xref}[¶](#section-6.1-10.6){.pilcrow}]{#section-6.1-10.6}
:::
:::

::: {#SecRec}
::: {#section-6.2 .section}
### [6.2.](#section-6.2){.section-number .selfRef} [Communication Security Requirements](#name-communication-security-requ){.section-name .selfRef} {#name-communication-security-requ}

Enforcing secure communication requires tightening up the Attachment
Daemon to require the use of command `STARTTLS` for commands sent over
the global Internet. In such a situation, an Attachment Daemon listening
for traffic other than from `localhost`:[¶](#section-6.2-1){.pilcrow}

1.  ::: {#section-6.2-2.1}
    ::: {#should}
    [SHOULD]{.bcp14} require and accept command
    `STARTTLS`,[¶](#should){.pilcrow}
    :::
    :::

2.  ::: {#section-6.2-2.2}
    ::: {#must}
    [MUST]{.bcp14} encrypt all communication with a Management Daemon,
    and[¶](#must){.pilcrow}
    :::
    :::

3.  ::: {#section-6.2-2.3}
    ::: {#shall}
    [SHALL]{.bcp14} refuse all non-encrypted commands, except an initial
    `STARTTLS`.[¶](#shall){.pilcrow}
    :::
    :::

Notes:[¶](#section-6.2-3){.pilcrow}

-   ::: {#section-6.2-4.1}
    ::: {#note-should .normal}
    The [SHOULD]{.bcp14}, rather than [MUST]{.bcp14}, in [Section 6.2,
    Paragraph 2, Item 1](#should){.xref} above allows system
    administrators to enforce secure communication using other
    techniques that do not involve the `STARTTLS`
    command.[¶](#note-should){.pilcrow}
    :::
    :::

-   [If an Attachment Daemon requires that all commands be encrypted as
    required by the [MUST]{.bcp14} in [Section 6.2, Paragraph 2, Item
    2](#must){.xref} above, then, automatically, each Management Daemon
    [MUST]{.bcp14} encrypt as well, since it has to do so in order to
    gain access.[¶](#section-6.2-4.2){.pilcrow}]{#section-6.2-4.2}

-   [The [SHALL]{.bcp14} in [Section 6.2, Paragraph 2, Item
    3](#shall){.xref} above applies to traffic from the global Internet.
    An Attachment Daemon [MAY]{.bcp14} accept unencrypted commands from
    `localhost` if the local installation\'s security practices allow
    it, for example, in a dedicated
    appliance.[¶](#section-6.2-4.3){.pilcrow}]{#section-6.2-4.3}

Firewalls [SHOULD]{.bcp14} be used to restrict the communication between
the Attachment Daemon and the accepted Management Daemons, prohibiting
and discarding traffic from any systems that are not part of the
envisioned power management setup. Note: See [Section 6.2, Paragraph 4,
Item 1](#note-should){.xref} above on the use of
[SHOULD]{.bcp14}.[¶](#section-6.2-5){.pilcrow}

::: {#certsec}
::: {#section-6.2.1 .section}
#### [6.2.1.](#section-6.2.1){.section-number .selfRef} [Certificate Security](#name-certificate-security){.section-name .selfRef} {#name-certificate-security}

In long-lived installations, such as those found in UPS management,
careful certificate management is essential, whether the certificate is
provided by a Certificate Authority or is a self-signed certificate. For
example, the expiration times of both the certificate containing the
public key and the signing certificate should be
specified.[¶](#section-6.2.1-1){.pilcrow}
:::
:::
:::
:::

::: {#Attacks}
::: {#section-6.3 .section}
### [6.3.](#section-6.3){.section-number .selfRef} [Attacks and Defenses](#name-attacks-and-defenses){.section-name .selfRef} {#name-attacks-and-defenses}

::: {#Eavesdropping}
::: {#section-6.3.1 .section}
#### [6.3.1.](#section-6.3.1){.section-number .selfRef} [Eavesdropping](#name-eavesdropping){.section-name .selfRef} {#name-eavesdropping}

The defense against eavesdropping is encryption of the commands and
responses passed between the client Management Daemon and server
Attachment Daemon. The protocol provides command `STARTTLS`, see
[Section 4.2.12](#starttls){.xref}, which calls on the Attachment Daemon
to support TLS encryption of the communication. If this command is
accepted, the Management Daemon also
encrypts.[¶](#section-6.3.1-1){.pilcrow}

In current NUT Project practice, the use of TLS is optional; however, a
Management Daemon may refuse to accept unencrypted communication. This
is done by setting declarations `FORCESSL` to 1 and `CERTVERIFY` to 1 in
the Management Daemon configuration file.[¶](#section-6.3.1-2){.pilcrow}

::: {#section-6.3.1.1 .section}
##### [6.3.1.1.](#section-6.3.1.1){.section-number .selfRef} [Misplaced Declarations Requiring TLS](#name-misplaced-declarations-requ){.section-name .selfRef} {#name-misplaced-declarations-requ}

A further weakness is that the `FORCESSL` and `CERTVERIFY` declarations,
which enforce use of encryption, are in the client Management Daemon
configuration file and not in the Attachment Daemon. Secure practice
requires enforcement by the server Attachment Daemon, rather than a
possibly rogue client Management Daemon out on the
Internet.[¶](#section-6.3.1.1-1){.pilcrow}

This weakness may be mitigated with strict firewall rules that would
prevent the rogue client Management Daemon from accessing the Attachment
Daemon.[¶](#section-6.3.1.1-2){.pilcrow}
:::

::: {#section-6.3.1.2 .section}
##### [6.3.1.2.](#section-6.3.1.2){.section-number .selfRef} [Weak Protection in Previous Version 2.7.4](#name-weak-protection-in-previous){.section-name .selfRef} {#name-weak-protection-in-previous}

Although version 2.8.0 of NUT supports TLS 1.3
\[[RFC8446](#RFC8446){.xref}\] with X.509 v3 certificates as defined by
\[[RFC5280](#RFC5280){.xref}\], previous version 2.7.4 only supported
earlier SSL/TLS versions. To overcome this weakness, The following
techniques have been used:[¶](#section-6.3.1.2-1){.pilcrow}

-   [Shims; see [Appendix
    D.1](#Shims){.xref}[¶](#section-6.3.1.2-2.1){.pilcrow}]{#section-6.3.1.2-2.1}
-   [TLS tunnel; see [Appendix
    D.2](#TLStunnel){.xref}[¶](#section-6.3.1.2-2.2){.pilcrow}]{#section-6.3.1.2-2.2}
-   [Virtual Private Network (VPN); see [Appendix
    D.3](#VPN){.xref}[¶](#section-6.3.1.2-2.3){.pilcrow}]{#section-6.3.1.2-2.3}
-   [Virtual Local Area Network (VLAN); see [Appendix
    D.4](#VLAN){.xref}[¶](#section-6.3.1.2-2.4){.pilcrow}]{#section-6.3.1.2-2.4}
:::
:::
:::

::: {#Man-in-the-Middle}
::: {#section-6.3.2 .section}
#### [6.3.2.](#section-6.3.2){.section-number .selfRef} [Man-in-the-Middle](#name-man-in-the-middle){.section-name .selfRef} {#name-man-in-the-middle}

The protocol relies on TLS encryption to prevent man-in-the-middle
attacks. See [Appendix D](#AppendixEavesdropping){.xref} for defense
methods used for previous NUT version
2.7.4.[¶](#section-6.3.2-1){.pilcrow}
:::
:::

::: {#Masquerade}
::: {#section-6.3.3 .section}
#### [6.3.3.](#section-6.3.3){.section-number .selfRef} [Masquerade Attack: Agent Verification](#name-masquerade-attack-agent-ver){.section-name .selfRef} {#name-masquerade-attack-agent-ver}

::: {#AgentVerif}
The protocol allows a malicious client acting as a Management Daemon to
send command `FSD` to an Attachment Daemon to shut down a working system
and its power supply, as described in The Shutdown Story section (see
[Appendix B](#shutdownstory){.xref}). Similarly, a malicious client
could turn off the UPS power outlets, causing the system to
fail.[¶](#section-6.3.3-1){.pilcrow}
:::

The protocol provides commands `USERNAME` (see [Section
4.2.13](#username){.xref}) and `PASSWORD` (see [Section
4.2.8](#password){.xref}), which allow an administrative user in a
Management Daemon to authenticate itself to the Attachment Daemon, as a
defense against masquerade attacks. The administrative username and
password need protection against local malicious users. This is done by
restricting access to the configuration
files.[¶](#section-6.3.3-2){.pilcrow}
:::
:::

::: {#Messageidm}
::: {#section-6.3.4 .section}
#### [6.3.4.](#section-6.3.4){.section-number .selfRef} [Message Insertion, Deletion, and Modification](#name-message-insertion-deletion-){.section-name .selfRef} {#name-message-insertion-deletion-}

The protocol relies on TLS encryption to prevent message insertion,
deletion, and modification attacks. See [Appendix
D](#AppendixEavesdropping){.xref} for defense methods used for previous
NUT version 2.7.4.[¶](#section-6.3.4-1){.pilcrow}
:::
:::

::: {#Replay}
::: {#section-6.3.5 .section}
#### [6.3.5.](#section-6.3.5){.section-number .selfRef} [Replay](#name-replay){.section-name .selfRef} {#name-replay}

There are two cases:[¶](#section-6.3.5-1){.pilcrow}

1.  [The replay is from a system other than an approved Management
    Daemon, i.e., the protocol relies on a firewall to block the
    traffic.[¶](#section-6.3.5-2.1){.pilcrow}]{#section-6.3.5-2.1}
2.  [The replay is from an approved Management Daemon. i.e., the
    protocol relies on the Management Daemon\'s own security to prevent
    unauthorized
    access.[¶](#section-6.3.5-2.2){.pilcrow}]{#section-6.3.5-2.2}
:::
:::

::: {#Exhaustion}
::: {#section-6.3.6 .section}
#### [6.3.6.](#section-6.3.6){.section-number .selfRef} [Denial of Service](#name-denial-of-service){.section-name .selfRef} {#name-denial-of-service}

The protocol relies on a very tightly specified firewall to prevent
denial-of-service attacks. Only designated client Management Daemons
should be able to reach the server Attachment
Daemon.[¶](#section-6.3.6-1){.pilcrow}
:::
:::
:::
:::
:::
:::

::: {#section-7 .section}
## [7.](#section-7){.section-number .selfRef} [IANA Considerations](#name-iana-considerations){.section-name .selfRef} {#name-iana-considerations}

The protocol specified by this text runs over port 3493/TCP (nut), which
is registered by the Network UPS Tools (NUT)
Project.[¶](#section-7-1){.pilcrow}

This document has been added to the registration\'s Reference field in
the \"Service Name and Transport Protocol Port Number Registry\"
\[[Registry](#Registry){.xref}\].[¶](#section-7-2){.pilcrow}
:::

::: {#implementation}
::: {#section-8 .section}
## [8.](#section-8){.section-number .selfRef} [Implementation Status](#name-implementation-status){.section-name .selfRef} {#name-implementation-status}

This section presents a very short summary of the status of the Network
UPS Tools project.[¶](#section-8-1){.pilcrow}

-   [May 1996: The first hack as a cron
    job.[¶](#section-8-2.1){.pilcrow}]{#section-8-2.1}

-   [September 1997: The first server-client
    code.[¶](#section-8-2.2){.pilcrow}]{#section-8-2.2}

-   [March 1998: First public
    release.[¶](#section-8-2.3){.pilcrow}]{#section-8-2.3}

-   [June 1999: Code rewrite with a UPS Driver `smartups`, an Attachment
    Daemon `upsd`, and a simple Management
    Daemon.[¶](#section-8-2.4){.pilcrow}]{#section-8-2.4}

-   [September 1999: The project became \"Network UPS Tools\". The
    Management Daemon `upsmon` supported Primary/Secondary
    configurations.[¶](#section-8-2.5){.pilcrow}]{#section-8-2.5}

-   [June 2001: Common core for multiple
    Drivers.[¶](#section-8-2.6){.pilcrow}]{#section-8-2.6}

-   [May 2002: IANA granted port 3493/TCP (nut). August: release 1.0.0.
    November: OpenSSL
    support.[¶](#section-8-2.7){.pilcrow}]{#section-8-2.7}

-   [April 2003: The initial set of command and variable names was
    designed.[¶](#section-8-2.8){.pilcrow}]{#section-8-2.8}

-   ::: {#section-8-2.9}
    ::: {#arno .compact}
    February 2005: Arnaud Quette took over the project lead from Russell
    Kroll.[¶](#arno){.pilcrow}
    :::
    :::

-   [March 2016: Version 2.7.4 released, supported over 100 device
    manufacturers and hundreds of UPS
    models.[¶](#section-8-2.10){.pilcrow}]{#section-8-2.10}

-   [November 2020: Evgeny \"Jim\" Klimov took over project lead from
    Arnaud Quette.[¶](#section-8-2.11){.pilcrow}]{#section-8-2.11}

-   [May 2022: Version 2.8.0 released, supporting protocol version
    1.3.[¶](#section-8-2.12){.pilcrow}]{#section-8-2.12}

See \[[githist](#githist){.xref}\] and Appendix J
\[[History](#History){.xref}\] for a detailed history of the NUT
Project.[¶](#section-8-3){.pilcrow}

::: {#section-8.1 .section}
### [8.1.](#section-8.1){.section-number .selfRef} [Inclusion in Software Distributions](#name-inclusion-in-software-distr){.section-name .selfRef} {#name-inclusion-in-software-distr}

The programs `upsd`, `upsmon`, `upssched`, `upsc`, `upscmd`, and `upsrw`
have been included in the package known as \"nut\" in the package
systems of many distributions, i.e., all the major Linux distributions
and Unix distributions, such as OpenBSD and OpenSolaris. A Microsoft
Windows version has been developed but was not
maintained.[¶](#section-8.1-1){.pilcrow}
:::

::: {#MinSup}
::: {#section-8.2 .section}
### [8.2.](#section-8.2){.section-number .selfRef} [Recommended Minimum Support](#name-recommended-minimum-support){.section-name .selfRef} {#name-recommended-minimum-support}

The features provided by current UPS units vary widely. However,
experience shows that a minimum feature set is needed for satisfactory
use of the NUT Project software. A full list of variables is available
in [source code file docs/nut-names.txt](#gitvars){.xref}
\[[gitvars](#gitvars){.xref}\], which serves as the Recording
Document.[¶](#section-8.2-1){.pilcrow}

::: {#MinSupPC}
::: {#section-8.2.1 .section}
#### [8.2.1.](#section-8.2.1){.section-number .selfRef} [Desktop PC Variables](#name-desktop-pc-variables){.section-name .selfRef} {#name-desktop-pc-variables}

The following variables form a minimum set suitable for a desktop PC. It
is expected that, on public power supply failure, the PC will be halted.
It will not restart automatically when power
returns.[¶](#section-8.2.1-1){.pilcrow}

-   [`battery.charge`[¶](#section-8.2.1-2.1){.pilcrow}]{#section-8.2.1-2.1}
-   [`battery.charge.low`[¶](#section-8.2.1-2.2){.pilcrow}]{#section-8.2.1-2.2}
-   [`device.mfr`[¶](#section-8.2.1-2.3){.pilcrow}]{#section-8.2.1-2.3}
-   [`device.model`[¶](#section-8.2.1-2.4){.pilcrow}]{#section-8.2.1-2.4}
-   [`ups.status` with the minimum status symbol set `OL` `OB` `LB`
    `FSD`; see [Section
    5.1](#symbols){.xref}[¶](#section-8.2.1-2.5){.pilcrow}]{#section-8.2.1-2.5}
:::
:::

::: {#MinSupServer}
::: {#section-8.2.2 .section}
#### [8.2.2.](#section-8.2.2){.section-number .selfRef} [Unattended Servers and Additional Variables](#name-unattended-servers-and-addi){.section-name .selfRef} {#name-unattended-servers-and-addi}

The following additional variables are needed in a minimum set suitable
for an unattended server. It is expected that, on public power supply
failure, the server will be halted. It will restart automatically when
power returns.[¶](#section-8.2.2-1){.pilcrow}

-   [`battery.date`[¶](#section-8.2.2-2.1){.pilcrow}]{#section-8.2.2-2.1}
-   [`device.serial`[¶](#section-8.2.2-2.2){.pilcrow}]{#section-8.2.2-2.2}
-   [`ups.delay.shutdown`[¶](#section-8.2.2-2.3){.pilcrow}]{#section-8.2.2-2.3}
-   [`ups.delay.start`[¶](#section-8.2.2-2.4){.pilcrow}]{#section-8.2.2-2.4}
:::
:::

::: {#MinSupCommands}
::: {#section-8.2.3 .section}
#### [8.2.3.](#section-8.2.3){.section-number .selfRef} [Commands and Other Technical Terms](#name-commands-and-other-technica){.section-name .selfRef} {#name-commands-and-other-technica}

Satisfactory use of the NUT Project software requires support for all
the commands specified in protocol version 1.3, software version
2.8.0.[¶](#section-8.2.3-1){.pilcrow}
:::
:::

::: {#Version.2.7.4}
::: {#section-8.2.4 .section}
#### [8.2.4.](#section-8.2.4){.section-number .selfRef} [Support for Earlier Versions](#name-support-for-earlier-version){.section-name .selfRef} {#name-support-for-earlier-version}

In order to ease migration from software version 2.7.4, which supported
protocol version 1.2, software version 2.8.0 also supports the technical
terms used in protocol version 1.2. See [Appendix
C](#differences){.xref} for the
differences.[¶](#section-8.2.4-1){.pilcrow}
:::
:::
:::
:::
:::
:::

::: {#section-9 .section}
## [9.](#section-9){.section-number .selfRef} [References](#name-references){.section-name .selfRef} {#name-references}

::: {#section-9.1 .section}
### [9.1.](#section-9.1){.section-number .selfRef} [Normative References](#name-normative-references){.section-name .selfRef} {#name-normative-references}

\[RFC0020\]
:   [Cerf, V.]{.refAuthor}, [\"ASCII format for network
    interchange\"]{.refTitle}, [STD 80]{.seriesInfo}, [RFC
    20]{.seriesInfo}, [DOI 10.17487/RFC0020]{.seriesInfo}, October 1969,
    \<<https://www.rfc-editor.org/info/rfc20>\>.
:   

\[RFC2119\]
:   [Bradner, S.]{.refAuthor}, [\"Key words for use in RFCs to Indicate
    Requirement Levels\"]{.refTitle}, [BCP 14]{.seriesInfo}, [RFC
    2119]{.seriesInfo}, [DOI 10.17487/RFC2119]{.seriesInfo}, March 1997,
    \<<https://www.rfc-editor.org/info/rfc2119>\>.
:   

\[RFC5234\]
:   [Crocker, D., Ed.]{.refAuthor} and [P. Overell]{.refAuthor},
    [\"Augmented BNF for Syntax Specifications: ABNF\"]{.refTitle}, [STD
    68]{.seriesInfo}, [RFC 5234]{.seriesInfo}, [DOI
    10.17487/RFC5234]{.seriesInfo}, January 2008,
    \<<https://www.rfc-editor.org/info/rfc5234>\>.
:   

\[RFC7405\]
:   [Kyzivat, P.]{.refAuthor}, [\"Case-Sensitive String Support in
    ABNF\"]{.refTitle}, [RFC 7405]{.seriesInfo}, [DOI
    10.17487/RFC7405]{.seriesInfo}, December 2014,
    \<<https://www.rfc-editor.org/info/rfc7405>\>.
:   

\[RFC8174\]
:   [Leiba, B.]{.refAuthor}, [\"Ambiguity of Uppercase vs Lowercase in
    RFC 2119 Key Words\"]{.refTitle}, [BCP 14]{.seriesInfo}, [RFC
    8174]{.seriesInfo}, [DOI 10.17487/RFC8174]{.seriesInfo}, May 2017,
    \<<https://www.rfc-editor.org/info/rfc8174>\>.
:   
:::

::: {#section-9.2 .section}
### [9.2.](#section-9.2){.section-number .selfRef} [Informative References](#name-informative-references){.section-name .selfRef} {#name-informative-references}

\[C2ndEd\]
:   [Kernighan, B.]{.refAuthor} and [D. Ritchie]{.refAuthor}, [\"The C
    Programming Language\"]{.refTitle}, [2nd edition, Prentice Hall
    Software Series]{.refContent}, [ISBN
    0-13-110362-8]{.seriesInfo}, 1988.
:   

\[devguide\]
:   [Kroll, R.]{.refAuthor}, [Quette, A.]{.refAuthor},
    [Lepple, C.]{.refAuthor}, and [P. Selinger]{.refAuthor}, [\"Network
    UPS Tools Project Developer Guide\"]{.refTitle},
    \<<https://networkupstools.org/docs/developer-guide.chunked/ar01s09.html>\>.
:   

\[Documentation\]
:   [\"Network UPS Tools Documentation\"]{.refTitle},
    \<<https://networkupstools.org/documentation.html>\>.
:   

\[githist\]
:   [\"The Network UPS Tools repository, project history\"]{.refTitle},
    July 2022,
    \<<https://github.com/networkupstools/nut/blob/master/docs/history.txt>\>.
:   

\[gitvars\]
:   [\"The Network UPS Tools repository, variable names\"]{.refTitle},
    April 2022,
    \<<https://github.com/networkupstools/nut/blob/master/docs/nut-names.txt>\>.
:   

\[History\]
:   [Kroll, R.]{.refAuthor}, [Quette, A.]{.refAuthor}, and [A. de
    Korte]{.refAuthor}, [\"Network UPS Tools User Manual\"]{.refTitle},
    May 2022, \<<https://networkupstools.org/docs/user-manual.pdf>\>.
:   

\[HyTimeA\]
:   [ISO/IEC]{.refAuthor}, [\"Information technology \--
    Hypermedia/Time-based Structuring Language (HyTime)\"]{.refTitle},
    [ISO/IEC 10744:1997]{.seriesInfo}, August 1997.
:   

\[IEC62351-1\]
:   [IEC]{.refAuthor}, [\"Power systems management and associated
    information exchange \-- Data and communications security. Part 1:
    Communication network and system security \-- Introduction to
    security issues\"]{.refTitle}, [35 pages, TC 57 - Power systems
    management and associated information exchange]{.refContent}, [IEC
    TS 62351-1:2007]{.seriesInfo}, May 2007,
    \<<https://nanopdf.com/download/technical-iec-specification-ts-62351-1_pdf>\>.
:   

\[Library\]
:   [\"Devices Dumps Library\"]{.refTitle},
    \<<https://networkupstools.org/ddl/>\>.
:   

\[NUT\]
:   [\"Network UPS Tools, Devices Dumps Library\"]{.refTitle},
    \<<https://www.networkupstools.org>\>.
:   

\[nut-repository\]
:   [\"The Network UPS Tools repository\"]{.refTitle},
    \<<https://github.com/networkupstools/nut/>\>.
:   

\[nut-upsdev\]
:   [NUT]{.refAuthor}, [\"Network UPS Tools (NUT) Project Mailing List
    for Developers\"]{.refTitle},
    \<<https://alioth-lists.debian.net/cgi-bin/mailman/listinfo/nut-upsdev>\>.
:   

\[nut-upsuser\]
:   [NUT]{.refAuthor}, [\"Network UPS Tools (NUT) Project Mailing List
    for Users\"]{.refTitle},
    \<<https://alioth-lists.debian.net/cgi-bin/mailman/listinfo/nut-upsuser>\>.
:   

\[Registry\]
:   [IANA]{.refAuthor}, [\"Service Name and Transport Protocol Port
    Number Registry\"]{.refTitle},
    \<<https://www.iana.org/assignments/service-names-port-numbers/service-names-port-numbers.xhtml>\>.
:   

\[RFC3552\]
:   [Rescorla, E.]{.refAuthor} and [B. Korver]{.refAuthor},
    [\"Guidelines for Writing RFC Text on Security
    Considerations\"]{.refTitle}, [BCP 72]{.seriesInfo}, [RFC
    3552]{.seriesInfo}, [DOI 10.17487/RFC3552]{.seriesInfo}, July 2003,
    \<<https://www.rfc-editor.org/info/rfc3552>\>.
:   

\[RFC5280\]
:   [Cooper, D.]{.refAuthor}, [Santesson, S.]{.refAuthor},
    [Farrell, S.]{.refAuthor}, [Boeyen, S.]{.refAuthor},
    [Housley, R.]{.refAuthor}, and [W. Polk]{.refAuthor}, [\"Internet
    X.509 Public Key Infrastructure Certificate and Certificate
    Revocation List (CRL) Profile\"]{.refTitle}, [RFC
    5280]{.seriesInfo}, [DOI 10.17487/RFC5280]{.seriesInfo}, May 2008,
    \<<https://www.rfc-editor.org/info/rfc5280>\>.
:   

\[RFC7030\]
:   [Pritikin, M., Ed.]{.refAuthor}, [Yee, P., Ed.]{.refAuthor}, and [D.
    Harkins, Ed.]{.refAuthor}, [\"Enrollment over Secure
    Transport\"]{.refTitle}, [RFC 7030]{.seriesInfo}, [DOI
    10.17487/RFC7030]{.seriesInfo}, October 2013,
    \<<https://www.rfc-editor.org/info/rfc7030>\>.
:   

\[RFC7991\]
:   [Hoffman, P.]{.refAuthor}, [\"The \"xml2rfc\" Version 3
    Vocabulary\"]{.refTitle}, [RFC 7991]{.seriesInfo}, [DOI
    10.17487/RFC7991]{.seriesInfo}, December 2016,
    \<<https://www.rfc-editor.org/info/rfc7991>\>.
:   

\[RFC8446\]
:   [Rescorla, E.]{.refAuthor}, [\"The Transport Layer Security (TLS)
    Protocol Version 1.3\"]{.refTitle}, [RFC 8446]{.seriesInfo}, [DOI
    10.17487/RFC8446]{.seriesInfo}, August 2018,
    \<<https://www.rfc-editor.org/info/rfc8446>\>.
:   

\[RFC8894\]
:   [Gutmann, P.]{.refAuthor}, [\"Simple Certificate Enrolment
    Protocol\"]{.refTitle}, [RFC 8894]{.seriesInfo}, [DOI
    10.17487/RFC8894]{.seriesInfo}, September 2020,
    \<<https://www.rfc-editor.org/info/rfc8894>\>.
:   

\[SGML\]
:   [Goldfarb, C.]{.refAuthor}, [\"The SGML Handbook\"]{.refTitle},
    [Oxford University Press]{.refContent}, [ISBN-10
    0-19-853737-9]{.seriesInfo}, 1990.
:   

\[sgmlnorm\]
:   [OpenJade Project]{.refAuthor}, [\"OpenJade Distribution
    Page\"]{.refTitle}, \<<http://openjade.sourceforge.net/>\>.
:   

\[stunnel\]
:   [\"Stunnel\"]{.refTitle}, \<<https://www.stunnel.org/>\>.
:   
:::
:::

::: {#Annex1}
::: {#appendix-A .section}
## [Appendix A.](#appendix-A){.section-number .selfRef} [Variables](#name-variables){.section-name .selfRef} {#name-variables}

The UPS variables represent the abstracted state of the UPS unit.
Certain variables represent not only the state of some hardware feature
but also provide tunable values and Instant Commands; see [Section
2.5](#IC){.xref}. The full set of variables is recorded in the
[reference document for variable names](#gitvars){.xref}
\[[gitvars](#gitvars){.xref}\].[¶](#appendix-A-1){.pilcrow}

The number of variables used in a given deployment depends on the
sophistication of the UPS product; this annex shows a typical example of
the subset of variables used for a reasonably complete \"consumer
grade\" UPS. The NUT Project maintains a [large library of the variable
subsets](#Library){.xref} \[[Library](#Library){.xref}\] used by
different UPS models.[¶](#appendix-A-2){.pilcrow}

Note that successive versions of a given product may add or delete
features, causing a change in the subset of variables used. An example
is the removal of `ups.delay.start` from a \"consumer grade\" UPS. The
manufacturer reserves the feature for the \"professional\"
product.[¶](#appendix-A-3){.pilcrow}

An implementation of a Management Daemon acting as a utility program may
provide a listing of the variables available for a given product, for
example, utility program `upsc`, as included in the NUT package; see
[Section 2.6, Paragraph 3](#util){.xref}.[¶](#appendix-A-4){.pilcrow}

The following sections illustrate the use of variables by taking the
values associated with a typical product. The example is a 1600 Va 1000
W UPS.[¶](#appendix-A-5){.pilcrow}

::: {#appendix-A.1 .section}
### [A.1.](#appendix-A.1){.section-number .selfRef} [Typical UPS Variables](#name-typical-ups-variables){.section-name .selfRef} {#name-typical-ups-variables}

[]{#name-typical-ups-variables-2}

::: {#typvar}
  Variable                          Typical Value           Default Description
  --------------------------------- ----------------------- ------------------------------------------------------------------
  `battery.charge`                  `100`                   \"Battery charge (percent of full)\"
  `battery.charge.low`              `20`                    \"Remaining battery level when UPS switches to LB (percent)\"
  `battery.runtime`                 `1481`                  \"Battery runtime (seconds)\"
  `battery.type`                    `PbAc`                  \"Battery chemistry\"
  `device.mfr`                      `Example Mfg`           \"\"
  `device.model`                    `Economy 1600`          \"\"
  `device.serial`                   `1234567890`            \"\"
  `device.type`                     `ups`                   \"\"
  `driver.name`                     `usbhid-ups`            \"Driver name\"
  `driver.parameter.lowbatt`        `37`                    \"Driver parameter: \<name>\"
  `driver.parameter.offdelay`       `30`                    \"Driver parameter: \<name>\"
  `driver.parameter.ondelay`        `40`                    \"Driver parameter: \<name>\"
  `driver.parameter.pollfreq`       `30`                    \"Driver parameter: \<name>\"
  `driver.parameter.pollinterval`   `2`                     \"Driver parameter: \<name>\"
  `driver.parameter.port`           `auto`                  \"Driver parameter: \<name>\"
  `driver.parameter.synchronous`    `no`                    \"Driver parameter: \<name>\"
  `driver.parameter.vendorid`       `0999`                  \"Driver parameter: \<name>\"
  `driver.version`                  `2.8.0`                 \"Driver version - NUT release\"
  `driver.version.data`             `HID 1.39`              \"\"
  `driver.version.internal`         `0.41`                  \"Internal driver version\"
  `input.transfer.high`             `264`                   \"High voltage transfer point (V)\"
  `input.transfer.low`              `184`                   \"Low voltage transfer point (V)\"
  `outlet.1.desc`                   `PowerShare Outlet 1`   \"Outlet description\"
  `outlet.1.id`                     `2`                     \"Outlet system identifier\"
  `outlet.1.status`                 `on`                    \"Outlet switch status\"
  `outlet.1.switchable`             `no`                    \"Outlet switch ability\"
  `outlet.2.desc`                   `PowerShare Outlet 2`   \"Outlet description\"
  `outlet.2.id`                     `3`                     \"Outlet system identifier\"
  `outlet.2.status`                 `on`                    \"Outlet switch status\"
  `outlet.2.switchable`             `no`                    \"Outlet switch ability\"
  `outlet.desc`                     `Main Outlet`           \"Outlet description\"
  `outlet.id`                       `1`                     \"Outlet system identifier\"
  `outlet.power`                    `25`                    \"\"
  `outlet.switchable`               `no`                    \"Outlet switch ability\"
  `output.frequency.nominal`        `50`                    \"Nominal output frequency (Hz)\"
  `output.voltage`                  `230.0`                 \"Output voltage (V)\"
  `output.voltage.nominal`          `230`                   \"Nominal output voltage (V)\"
  `ups.beeper.status`               `enabled`               \"UPS beeper status\"
  `ups.delay.shutdown`              `20`                    \"Interval to wait after shutdown with delay command (seconds)\"
  `ups.delay.start`                 `30`                    \"Interval to wait before (re)starting the load (seconds)\"
  `ups.firmware`                    `02`                    \"UPS firmware\"
  `ups.load`                        `20`                    \"Load on UPS (percent of full)\"
  `ups.mfr`                         `Example Mfg`           \"UPS manufacturer\"
  `ups.model`                       `Economy 1600`          \"UPS model\"
  `ups.power.nominal`               `1600`                  \"UPS power rating (VA)\"
  `ups.productid`                   `ffff`                  \"Product ID for USB devices\"
  `ups.serial`                      `000000000`             \"UPS serial number\"
  `ups.status`                      `OL`                    \"UPS status\"
  `ups.temperature`                 `27`                    \"UPS temperature (C)\"
  `ups.timer.shutdown`              `0`                     \"Time before the load will be shutdown (seconds)\"
  `ups.timer.start`                 `0`                     \"Time before the load will be started (seconds)\"
  `ups.vendorid`                    `0999`                  \"Vendor ID for USB devices\"

  : [Table 6](#table-6){.selfRef}: [Typical UPS
  Variables](#name-typical-ups-variables-2){.selfRef}
:::
:::

::: {#rw}
::: {#appendix-A.2 .section}
### [A.2.](#appendix-A.2){.section-number .selfRef} [Typical UPS Readable and Writable Variables](#name-typical-ups-readable-and-wr){.section-name .selfRef} {#name-typical-ups-readable-and-wr}

Some of the features of a UPS are represented by variables that may be
tuned by the user. The following variables are typical of such tunable
features. The precise list depends on the model of UPS. An
implementation of a Management Daemon acting as a utility program may
provide a listing of the variables available, as well as acting on them,
for example, utility program `upsrw`, as included in the NUT package;
see [Section 2.6, Paragraph
3](#util){.xref}.[¶](#appendix-A.2-1){.pilcrow}

[]{#name-typical-readable-and-writab}

  Variable                   Typical Value           Default Description Provided as Response to the Command `GET DESC`
  -------------------------- ----------------------- --------------------------------------------------------------------
  `battery.charge.low`       `20`                    `"Remaining battery level when UPS switches to LB (percent)"`
  `input.transfer.high`      `264`                   `"High voltage transfer point (V)"`
  `input.transfer.low`       `184`                   `"Low voltage transfer point (V)"`
  `outlet.1.desc`            `PowerShare Outlet 1`   `"Outlet description"`
  `outlet.2.desc`            `PowerShare Outlet 2`   `"Outlet description"`
  `outlet.2.switchable`      `no`                    `"Outlet switch ability"`
  `outlet.desc`              `Main Outlet`           `"Outlet description"`
  `outlet.power`             `25`                    `"Description unavailable"`
  `output.voltage.nominal`   `230`                   `"Nominal output voltage (V)"`
  `ups.delay.shutdown`       `20`                    `"Interval to wait after shutdown with delay command (seconds)"`
  `ups.delay.start`          `30`                    `"Interval to wait before (re)starting the load (seconds)"`

  : [Table 7](#table-7){.selfRef}: [Typical Readable and Writable UPS
  Variables](#name-typical-readable-and-writab){.selfRef}
:::
:::

::: {#instcmdexamples}
::: {#appendix-A.3 .section}
### [A.3.](#appendix-A.3){.section-number .selfRef} [Typical UPS Instant Commands](#name-typical-ups-instant-command){.section-name .selfRef} {#name-typical-ups-instant-command}

Some of the features of a UPS are actions known as Instant Commands (see
[Section 2.5](#IC){.xref}), which may be ordered by the user. The
following variables represent such Instant Commands. The precise list
depends on the model of UPS. An implementation of a Management Daemon
acting as a utility program may provide a listing of the variables
available, as well as acting on them, for example, utility program
`upscmd`, as included in the NUT package; see [Section 2.6, Paragraph
3](#util){.xref}.[¶](#appendix-A.3-1){.pilcrow}

[]{#name-typical-instant-commands}

  Command              Meaning
  -------------------- -------------------------------------------------
  `beeper.disable`     Disable the UPS beeper
  `beeper.enable`      Enable the UPS beeper
  `beeper.mute`        Temporarily mute the UPS beeper
  `load.off`           Turn off the load immediately
  `load.off.delay`     Turn off the load with a delay (seconds)
  `load.on`            Turn on the load immediately
  `load.on.delay`      Turn on the load with a delay (seconds)
  `shutdown.return`    Turn off the load and return when power is back
  `shutdown.stayoff`   Turn off the load and remain off
  `shutdown.stop`      Stop a shutdown in progress

  : [Table 8](#table-8){.selfRef}: [Typical Instant
  Commands](#name-typical-instant-commands){.selfRef}
:::
:::
:::
:::

::: {#shutdownstory}
::: {#appendix-B .section}
## [Appendix B.](#appendix-B){.section-number .selfRef} [The Shutdown Story for System and UPS](#name-the-shutdown-story-for-syst){.section-name .selfRef} {#name-the-shutdown-story-for-syst}

This appendix provides background material helpful for a general
understanding of the relation between system and UPS. It does not define
any feature of the command-response
protocol.[¶](#appendix-B-1){.pilcrow}

We consider the steps involved in the shutdown and restart of a
long-running unattended server protected by a single UPS. The Management
Daemon runs in the server as shown in [Figure
8](#fig.story){.xref}.[¶](#appendix-B-2){.pilcrow}

[]{#name-long-running-unattended-ser}

::: {#fig.story}
::: {#appendix-B-3.1 .alignCenter .art-ascii-art .art-text .artwork}
               ,------------------SERVER------------------,
               |                    |                     |
     ,-----,   |     UPS       <-Commands        UPS      |
     | UPS |---|  Attachment        |         Management  |
     |     |===|    Daemon       Responses->    Daemon    |
     /-----\   '--------------------'---------------------'
                                 Internal
                                 loopback
:::

[Figure 8](#figure-8){.selfRef}: [Long-Running Unattended
Server](#name-long-running-unattended-ser){.selfRef}
:::

1.  ::: {#appendix-B-4.1}
    ::: {#start}
    *The public power supply is on.* The system runs normally. Every 5
    seconds, variable `ups.status` reports `OL`. *Days, weeks, months go
    by\...*[¶](#start){.pilcrow}
    :::
    :::

2.  [*Winter storm. Tree falls on power lines. The public power supply
    fails.* The server remains operational, running on the UPS battery.
    The Management Daemon polls the Attachment Daemon and detects status
    change `OL`-\>`OB`.[¶](#appendix-B-4.2){.pilcrow}]{#appendix-B-4.2}

3.  [The Management Daemon logs warning messages. The server is still
    operational, running on the UPS battery. *Minutes go
    by\...*[¶](#appendix-B-4.3){.pilcrow}]{#appendix-B-4.3}

4.  [The battery discharges below the level specified by variable
    `battery.charge.low`. The server remains operational, but the UPS
    battery will not last much longer. The Management Daemon polls the
    Attachment Daemon and detects status change
    `OB`-\>`OB`+`LB`.[¶](#appendix-B-4.4){.pilcrow}]{#appendix-B-4.4}

5.  [The Management Daemon logs the low battery
    event.[¶](#appendix-B-4.5){.pilcrow}]{#appendix-B-4.5}

6.  ::: {#appendix-B-4.6}
    ::: {#setFSD}
    The Management Daemon decides to call for a system shutdown. It sets
    status `FSD` in the Attachment Daemon to call on any Secondaries to
    shut down and waits for command `GET NUMATTACH` to report one single
    attachment, i.e., the Primary itself. The Management Daemon then
    issues the system shutdown command for itself.[¶](#setFSD){.pilcrow}
    :::
    :::

7.  ::: {#appendix-B-4.7}
    ::: {#upsdrvctl}
    The operating system\'s shutdown process takes over. During the
    system shutdown, a specific script to the NUT Project or an
    equivalent system service unit runs the command
    `upsdrvctl shutdown`. This tells the UPS that it is to shut down N
    seconds later where the default is N=20. Note that the \"shutdown\"
    of a UPS removes power from the outlet sockets but may not turn the
    UPS off completely. A delayed shutdown is sometimes audible, and the
    characteristic beeping of the UPS stops.[¶](#upsdrvctl){.pilcrow}
    :::
    :::

8.  [The system shuts down and powers down, hopefully before the N=20
    seconds have passed.[¶](#appendix-B-4.8){.pilcrow}]{#appendix-B-4.8}

9.  ::: {#appendix-B-4.9}
    ::: {#UPSshutdown}
    *N seconds after item [7](#upsdrvctl){.xref}* The UPS shuts down,
    i.e., it turns off its outlet sockets when N=20 seconds have passed.
    With some UPS units, there is an audible
    \"clunk\".[¶](#appendix-B-4.9.1){.pilcrow}

    What if the public power supply returns before the UPS shuts down?
    The UPS unit should be able to wait a configurable time with default
    30 seconds. These two timers start from the moment the UPS receives
    the `upsdrvctl shutdown` command. *Minutes, hours, days go
    by\...*[¶](#appendix-B-4.9.2){.pilcrow}
    :::
    :::

10. [*Some time later, maybe much later, the public power supply
    returns.* The UPS reconnects its outlets to send power to the
    protected system.[¶](#appendix-B-4.10){.pilcrow}]{#appendix-B-4.10}

11. ::: {#appendix-B-4.11}
    ::: {#UPSrestart}
    The system BIOS option \"Restore power on AC return\" or \"Restore
    to previous state\" has hopefully been selected and the system
    powers up. The bootstrap process of the operating system
    begins.[¶](#UPSrestart){.pilcrow}
    :::
    :::

12. [The operating system starts the Attachment Daemon and the
    Management Daemon. The Attachment Daemon starts the Driver and scans
    the UPS. The UPS status becomes
    `OL`+`LB`.[¶](#appendix-B-4.12){.pilcrow}]{#appendix-B-4.12}

13. [After some time, the battery charges above the `battery.charge.low`
    threshold, and the Attachment Daemon declares the status change
    `OL`+`LB`-\>`OL`. We are now back in the same situation as item
    [1](#start){.xref}
    above.[¶](#appendix-B-4.13){.pilcrow}]{#appendix-B-4.13}
:::
:::

::: {#differences}
::: {#appendix-C .section}
## [Appendix C.](#appendix-C){.section-number .selfRef} [Technical Terms: Historical Differences](#name-technical-terms-historical-){.section-name .selfRef} {#name-technical-terms-historical-}

This appendix lists the major differences between the technical terms
used in NUT software release 2.8.0 and documented in this text, as well
as those used in previous version 2.7.4 of the NUT
Project.[¶](#appendix-C-1){.pilcrow}

[]{#name-technical-terms-historical-d}

  -----------------------------------------------------------------------------
  Term in Previous\       Term in this Document,\ Reference
  Release NUT 2.7.4       Release NUT 2.8.0       
  ----------------------- ----------------------- -----------------------------
  ALREADY-LOGGED-IN       ALREADY-ATTACHED        [Table 3](#errors){.xref}

  ALREADY-SSL-MODE        TLS-ALREADY-ENABLED     [Table 3](#errors){.xref}

  `LOGIN`                 `ATTACH`                [Section
                                                  4.2.1](#attach){.xref}

  `LOGOUT`                `DETACH`                [Section
                                                  4.2.2](#detach){.xref}

  Master                  Primary                 [Section 2.7](#prim){.xref}

  `NETVER`                `PROTVER`               [Section
                                                  4.2.10](#protver){.xref}

  `NUMLOGINS`             `NUMATTACH`             [Section
                                                  4.2.4.3](#numattach){.xref}

  Slave                   Secondary               [Section 2.8](#sec){.xref}
  -----------------------------------------------------------------------------

  : [Table 9](#table-9){.selfRef}: [Technical Terms: Historical
  Differences](#name-technical-terms-historical-d){.selfRef}
:::
:::

::: {#AppendixEavesdropping}
::: {#appendix-D .section}
## [Appendix D.](#appendix-D){.section-number .selfRef} [Security Defenses in Release 2.7.4](#name-security-defenses-in-releas){.section-name .selfRef} {#name-security-defenses-in-releas}

Previous NUT version 2.7.4 did not provide support for TLS 1.3
\[[RFC8446](#RFC8446){.xref}\]. The following subsections describe
mitigating techniques.[¶](#appendix-D-1){.pilcrow}

::: {#Shims}
::: {#appendix-D.1 .section}
### [D.1.](#appendix-D.1){.section-number .selfRef} [Shims](#name-shims){.section-name .selfRef} {#name-shims}

Previous version 2.7.4 of NUT did not support TLS 1.3
\[[RFC8446](#RFC8446){.xref}\]. Where such protection is needed for
version 2.7.4, a possible technique introduces shims between the
Attachment Daemon and the network and between the network and the
Management Daemon, as shown in [Figure 9](#fig.shim){.xref}. These shims
provide TLS 1.3 support, thus allowing the Attachment Daemon and
Management Daemon to continue temporarily without having TLS
implementations themselves. The technique has been successfully
tested.[¶](#appendix-D.1-1){.pilcrow}

[]{#name-shims-provide-tls-support-d}

::: {#fig.shim}
::: {#appendix-D.1-2.1 .alignCenter .art-ascii-art .art-text .artwork}
                    TLS shim listens     TLS shim listens
                    on port TBD1/TCP     on port 3493/TCP
     ,-----,------------,----,               ,----,--------------,
     | UPS - Attachment |TLS | <-STARTTLS    | TLS|  Management  |
     |     |   Daemon   |shim|         OK--> |shim|    Daemon    |
     /-----'------------'----\               '----'--------------'
             Listens on
           port 3493/TCP
:::

[Figure 9](#figure-9){.selfRef}: [Shims Provide TLS Support During
Migration](#name-shims-provide-tls-support-d){.selfRef}
:::

::: {#appendix-D.1.1 .section}
#### [D.1.1.](#appendix-D.1.1){.section-number .selfRef} [Attachment Daemon Shim](#name-attachment-daemon-shim){.section-name .selfRef} {#name-attachment-daemon-shim}

The shim in front of the Attachment Daemon listens to incoming traffic
on port TBD1/TCP. When it receives the command `STARTTLS`,
it:[¶](#appendix-D.1.1-1){.pilcrow}

1.  [returns `OK` to the client and sets up TLS
    encapsulation.[¶](#appendix-D.1.1-2.1){.pilcrow}]{#appendix-D.1.1-2.1}
2.  [does not send `STARTTLS` to the Attachment Daemon port
    3493/TCP.[¶](#appendix-D.1.1-2.2){.pilcrow}]{#appendix-D.1.1-2.2}

All other commands and responses are passed
through.[¶](#appendix-D.1.1-3){.pilcrow}

Note: Port TBD1/TCP is not specified by this
text.[¶](#appendix-D.1.1-4){.pilcrow}
:::

::: {#appendix-D.1.2 .section}
#### [D.1.2.](#appendix-D.1.2){.section-number .selfRef} [Management Daemon Shim](#name-management-daemon-shim){.section-name .selfRef} {#name-management-daemon-shim}

The shim in front of the Management Daemon listens for incoming traffic
on port 3493/TCP. When it receives the command `STARTTLS`,
it:[¶](#appendix-D.1.2-1){.pilcrow}

1.  [returns `FEATURE-NOT-CONFIGURED` to the
    client.[¶](#appendix-D.1.2-2.1){.pilcrow}]{#appendix-D.1.2-2.1}
2.  [sends `STARTTLS` to the Attachment Daemon on port
    TBD1/TCP.[¶](#appendix-D.1.2-2.2){.pilcrow}]{#appendix-D.1.2-2.2}

All other commands and responses are passed
through.[¶](#appendix-D.1.2-3){.pilcrow}
:::
:::
:::

::: {#TLStunnel}
::: {#appendix-D.2 .section}
### [D.2.](#appendix-D.2){.section-number .selfRef} [TLS Tunnels](#name-tls-tunnels){.section-name .selfRef} {#name-tls-tunnels}

Another technique is the use of [TLS tunnels](#RFC8446){.xref}
\[[RFC8446](#RFC8446){.xref}\], using a software, such as stunnel
\[[stunnel](#stunnel){.xref}\], which adds OpenSSL-based TLS support
without modifying the Attachment Daemon or Management Daemon. The NUT
Project has no procedure to enforce this on
sites.[¶](#appendix-D.2-1){.pilcrow}
:::
:::

::: {#VPN}
::: {#appendix-D.3 .section}
### [D.3.](#appendix-D.3){.section-number .selfRef} [VPN](#name-vpn){.section-name .selfRef} {#name-vpn}

A further option to secure communications is very similar to [TLS
tunneling](#RFC8446){.xref} \[[RFC8446](#RFC8446){.xref}\] and consists
of routing the NUT traffic through a Virtual Private Network
(VPN).[¶](#appendix-D.3-1){.pilcrow}
:::
:::

::: {#VLAN}
::: {#appendix-D.4 .section}
### [D.4.](#appendix-D.4){.section-number .selfRef} [VLAN](#name-vlan){.section-name .selfRef} {#name-vlan}

A fourth option is to isolate the UPS management traffic at the network
switching level using a Virtual LAN (VLAN)
technique.[¶](#appendix-D.4-1){.pilcrow}

[]{#name-ups-management-protocol-run}

::: {#fig.VLAN}
::: {#appendix-D.4-2.1 .alignCenter .art-ascii-art .art-text .artwork}
              ,-------------,               ,-------------,
    ,-----,   | Attachment  |               | Management  |
    | UPS |---|   Daemon    |               |   Daemon    |
    |     |   |-------------|      UPS      |-------------|
    |     |===|             |   Management  |    UPS      |
    /-----\   | Protected   |~~~~~~~~~~~~~~~| Management  |
              |  Server     |     VLAN      |   Client    |
              |             |               '-------------'
              '-------------'
          Production | VLAN
                 ,---|-------,
                ,-----------,|
               ,-----------,|'
               |  Clients  |'
               '-----------'
:::

[Figure 10](#figure-10){.selfRef}: [UPS Management Protocol Runs over
Its Own VLAN](#name-ups-management-protocol-run){.selfRef}
:::

In [Figure 10](#fig.VLAN){.xref}, there are two VLANS: the main traffic
between the protected server and its clients using the production VLAN.
The UPS management traffic between the Attachment and Management Daemons
uses the UPS management VLAN marked as
\~\~\~\~\~\~\~\~\~\~\~\~\~.[¶](#appendix-D.4-3){.pilcrow}
:::
:::
:::
:::

::: {#adsec}
::: {#appendix-E .section}
## [Appendix E.](#appendix-E){.section-number .selfRef} [Administrative Security](#name-administrative-security){.section-name .selfRef} {#name-administrative-security}

Administrative commands, such as `FSD`, `INSTCMD`, and `SET`, are
powerful and can have a deep effect on system integrity. For example,
the command `FSD` is involved in mission-critical system shutdown
decisions. Access to them needs to be managed and restricted. This
section presents the current practice.[¶](#appendix-E-1){.pilcrow}

::: {#adminuser}
::: {#appendix-E.1 .section}
### [E.1.](#appendix-E.1){.section-number .selfRef} [Management of Administrative Users](#name-management-of-administrativ){.section-name .selfRef} {#name-management-of-administrativ}

The Attachment Daemon maintains a file (currently `upsd.users`) that
defines each administrative user. Note that these users are independent
of those recorded in file `/etc/passwd`. Each administrative user gets
its own section in file `upsd.users`. The declarations in that section
set the parameters that define that user\'s privileges. The section
begins with the name of the user enclosed in square brackets, opening
bracket (\[) and closing bracket (\]), and continues until the next
username in brackets or EOF.[¶](#appendix-E.1-1){.pilcrow}

For example, the following file declares two administrative users,
`admin` and `pfy`:[¶](#appendix-E.1-2){.pilcrow}

::: {#appendix-E.1-3}
``` {.lang-shell .sourcecode}
   [admin]
       password = sekret
       upsmon master
       actions = SET
       instcmds = ALL
   [pfy]
       password = sekret
       instcmds = test.panel.start
       instcmds = test.panel.stop
```

[¶](#appendix-E.1-3){.pilcrow}
:::

Within each section, the administrative user declarations
are:[¶](#appendix-E.1-4){.pilcrow}

[]{#name-administrative-user-declara}

+-----------------------------------+-----------------------------------+
| Declaration                       | Meaning                           |
+===================================+===================================+
| `actions`                         | Allow the user to do certain      |
|                                   | things in the Attachment Daemon.  |
|                                   | To specify multiple actions, use  |
|                                   | multiple instances of the         |
|                                   | declaration. Valid actions        |
|                                   | are:[¶](#                         |
|                                   | appendix-E.1-5.2.1.2.1){.pilcrow} |
|                                   |                                   |
|                                   | -   [`FSD` Set the \"Forced       |
|                                   |     Shutdown\" flag for this UPS. |
|                                   |     See [Section                  |
|                                   |     4.2.3](#FSD){.xref}.[¶        |
|                                   | ](#appendix-E.1-5.2.1.2.2.1){.pil |
|                                   | crow}]{#appendix-E.1-5.2.1.2.2.1} |
|                                   | -   [`SET` Change the value of a  |
|                                   |     UPS variable. See [Section    |
|                                   |     4.2.11](#set){.xref}.[¶       |
|                                   | ](#appendix-E.1-5.2.1.2.2.2){.pil |
|                                   | crow}]{#appendix-E.1-5.2.1.2.2.2} |
+-----------------------------------+-----------------------------------+
| `instcmds`                        | Let a user initiate specific      |
|                                   | Instant Commands. See [Section    |
|                                   | 4.2.6](#instcmd){.xref}. Use      |
|                                   | value `ALL` to grant all commands |
|                                   | automatically. To specify         |
|                                   | multiple commands, use multiple   |
|                                   | instances of the instcmds field.  |
|                                   | For the full list of what a given |
|                                   | UPS supports, use client          |
|                                   | `upscmd -l` supplied by the NUT   |
|                                   | Project. The `LIST CMD` command   |
|                                   | is issued within the client       |
|                                   | `upscmd`.                         |
+-----------------------------------+-----------------------------------+
| `password`                        | Set the password for this user.   |
|                                   | *Your password should be more     |
|                                   | secure than the examples shown.*  |
+-----------------------------------+-----------------------------------+
| `upsmon`                          | Add the necessary actions for a   |
|                                   | Management Daemon to process a    |
|                                   | system shutdown. In current       |
|                                   | practice, the value is still      |
|                                   | `master` or `slave`. Note that    |
|                                   | there is no EQUALS =.             |
+-----------------------------------+-----------------------------------+

: [Table 10](#table-10){.selfRef}: [Administrative User
Declarations](#name-administrative-user-declara){.selfRef}
:::
:::

::: {#adsecclient}
::: {#appendix-E.2 .section}
### [E.2.](#appendix-E.2){.section-number .selfRef} [An Administrative User of a Client Management Daemon](#name-an-administrative-user-of-a){.section-name .selfRef} {#name-an-administrative-user-of-a}

The following examples show the current security practices for
administrative users of a client Management Daemon. They also illustrate
the command pair `USERNAME` and `PASSWORD`. See Sections
[4.2.13](#username){.xref} and
[4.2.8](#password){.xref}.[¶](#appendix-E.2-1){.pilcrow}

::: {#appendix-E.2.1 .section}
#### [E.2.1.](#appendix-E.2.1){.section-number .selfRef} [An Administrative User Logs into a Short Session](#name-an-administrative-user-logs){.section-name .selfRef} {#name-an-administrative-user-logs}

In this simple example of current practice, the system administrator
sets the battery level at which an Attachment Daemon will raise the
status `LB`, represented by variable `battery.charge.low`, to 35% of
full charge. A system administrator types the following command to call
the client `upsrw` supplied by the NUT
Project.[¶](#appendix-E.2.1-1){.pilcrow}

::: {#appendix-E.2.1-2}
``` {.lang-shell .sourcecode}
upsrw -s battery.charge.low=35 -u admin -p sekret UPS-1@example.com
```

[¶](#appendix-E.2.1-2){.pilcrow}
:::

Option `-s` specifies the variable and the value, option `-u` specifies
the `USERNAME`, option `-p` specifies the `PASSWORD`, and
`UPS-1@example.com` is the UPS. The `USERNAME` and `PASSWORD` commands
are issued within the client `upsrw`, and the session is of short
duration.[¶](#appendix-E.2.1-3){.pilcrow}

Note: Your password should be stronger than the example
shown.[¶](#appendix-E.2.1-4){.pilcrow}
:::

::: {#longsess}
::: {#appendix-E.2.2 .section}
#### [E.2.2.](#appendix-E.2.2){.section-number .selfRef} [An Administrative User Logs into a Long Session](#name-an-administrative-user-logs-){.section-name .selfRef} {#name-an-administrative-user-logs-}

In this second example of current practice, the long-running Management
Daemon `upsmon`, which is responsible for initiating system shutdowns
and which is provided by the NUT Project, issues commands `USERNAME` and
`PASSWORD` when it starts up. The data values needed for the `USERNAME`
and `PASSWORD` commands are provided by a configuration file
`upsmon.conf`, which contains the line:[¶](#appendix-E.2.2-1){.pilcrow}

::: {#appendix-E.2.2-2}
``` {.lang-shell .sourcecode}
MONITOR UPS-1@example.com 1 admin sekret master
```

[¶](#appendix-E.2.2-2){.pilcrow}
:::

This says that the UPS to be monitored is `UPS-1@example.com`. It
provides 1 single power supply. The administrative user is `admin` with
password `sekret`. The Management Daemon acts as a Primary, although
current practice still uses the former term
`master`.[¶](#appendix-E.2.2-3){.pilcrow}

The `USERNAME` and `PASSWORD` commands are contained within the client
`upsmon`, and the session is of long
duration.[¶](#appendix-E.2.2-4){.pilcrow}
:::
:::
:::
:::
:::
:::

::: {#Ack}
::: {#appendix-F .section}
## [Acknowledgments](#name-acknowledgments){.section-name .selfRef} {#name-acknowledgments}

This document is based on the NUT Project
[documentation](#devguide){.xref} \[[devguide](#devguide){.xref}\]. The
editor acknowledges the work of [Charles Lepple]{.contact-name}, [Arjen
de Korte]{.contact-name}, [Arnaud Quette]{.contact-name}, [Jim
Klimov]{.contact-name}, [Russell Kroll]{.contact-name}, [Manuel
Wolfshant]{.contact-name}, [Greg Troxel]{.contact-name}, [Mark
Hansen]{.contact-name}, and many others who contribute to the
[nut-upsuser](#nut-upsuser){.xref}
\[[nut-upsuser](#nut-upsuser){.xref}\] and
[nut-upsdev](#nut-upsdev){.xref} \[[nut-upsdev](#nut-upsdev){.xref}\]
mailing lists.[¶](#appendix-F-1){.pilcrow}

Earlier draft versions of this document were prepared using an SGML DTD
\[[SGML](#SGML){.xref}\] and an XML meta-DTD defined by HyTime Annex A
\[[HyTimeA](#HyTimeA){.xref}\]. Unlike XML, SGML offers markup
minimization, and the earlier drafts took advantage of this. The
osgmlnorm \[[sgmlnorm](#sgmlnorm){.xref}\] program generated the XML
that was used as input to xml2rfc \[[RFC7991](#RFC7991){.xref}\], which
then created the document\'s current source. The editor acknowledges the
help received from [Carsten Bormann]{.contact-name} and [Julian
Reschke]{.contact-name} in the xml2rfc mailing
list.[¶](#appendix-F-2){.pilcrow}

Many helpful comments were received from [Eliot Lear]{.contact-name},
[Bart Smit]{.contact-name}, [David Zomaya]{.contact-name}, [Joyce
Norris]{.contact-name}, and [Ted
Mittelstaedt]{.contact-name}.[¶](#appendix-F-3){.pilcrow}
:::
:::

::: {#authors-addresses}
::: {#appendix-G .section}
## [Author\'s Address](#name-authors-address){.section-name .selfRef} {#name-authors-address}

::: {.left dir="auto"}
[Roger Price ([editor]{.role})]{.fn .nameRole}
:::

::: {.left dir="auto"}
[Network UPS Tools Project]{.org}
:::

::: {.left dir="auto"}
[France]{.country-name}
:::

::: email
Email: <ietf@rogerprice.org>
:::
:::
:::
